config.org
#+TITLE: Emacs 配置文档
#+AUTHOR: ManJack
#+DATE: \today
#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: article
#+LATEX_HEADER: \usepackage[margin=2.5cm]{geometry}
#+LATEX_HEADER: \usepackage{ctex}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \definecolor{boxblue}{RGB}{136,192,208} % Nord 主题蓝色
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage{amsmath, amssymb, amsfonts}  % 基础数学包
#+LATEX_HEADER: \usepackage{bm}                           % 粗体数学符号
#+LATEX_HEADER: \usepackage{mathtools}                    % amsmath 的增强
#+LATEX_HEADER: \setminted{
#+LATEX_HEADER:   breaklines=true,
#+LATEX_HEADER:   breakanywhere=true,
#+LATEX_HEADER:   frame=leftline,
#+LATEX_HEADER:   framerule=2pt,
#+LATEX_HEADER:   rulecolor=\color{boxblue},
#+LATEX_HEADER:   bgcolor=boxback,
#+LATEX_HEADER:   fontsize=\small,
#+LATEX_HEADER:   baselinestretch=1.2
#+LATEX_HEADER: }
#+LATEX_HEADER: \usepackage{tcolorbox}
#+LATEX_HEADER: \tcbuselibrary{listings,skins,breakable}
#+LATEX_HEADER: \setcounter{secnumdepth}{2}

#+LATEX_HEADER: % 超美代码框颜色
#+LATEX_HEADER: \definecolor{boxblue}{RGB}{70, 130, 180}
#+LATEX_HEADER: \definecolor{boxgreen}{RGB}{34, 139, 34}
#+LATEX_HEADER: \definecolor{boxpurple}{RGB}{148, 0, 211}
#+LATEX_HEADER: \definecolor{boxgray}{RGB}{108, 117, 125}
#+LATEX_HEADER: \definecolor{boxback}{RGB}{252, 252, 252}
#+LATEX_HEADER: \definecolor{boxframe}{RGB}{220, 220, 220}

#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \usepackage{caption}

#+LATEX_HEADER: % 定义注意事项框
#+LATEX_HEADER: \newtcolorbox{NOTE}{
#+LATEX_HEADER:     enhanced,
#+LATEX_HEADER:     colback=blue!5!white,
#+LATEX_HEADER:     colframe=blue!50!black,
#+LATEX_HEADER:     arc=3pt,
#+LATEX_HEADER:     boxrule=0.5pt,
#+LATEX_HEADER:     left=8pt,
#+LATEX_HEADER:     right=8pt,
#+LATEX_HEADER:     title={\textbf{注意}},
#+LATEX_HEADER:     fonttitle=\sffamily\bfseries,
#+LATEX_HEADER:     coltitle=blue!80!black,
#+LATEX_HEADER:     colbacktitle=blue!20!white
#+LATEX_HEADER: }

#+LATEX_HEADER: \newtcolorbox{WARNING}{
#+LATEX_HEADER:     enhanced,
#+LATEX_HEADER:     colback=red!5!white,
#+LATEX_HEADER:     colframe=red!50!black,
#+LATEX_HEADER:     arc=3pt,
#+LATEX_HEADER:     boxrule=0.5pt,
#+LATEX_HEADER:     left=8pt,
#+LATEX_HEADER:     right=8pt,
#+LATEX_HEADER:     title={\textbf{警告}},
#+LATEX_HEADER:     fonttitle=\sffamily\bfseries,
#+LATEX_HEADER:     coltitle=red!80!black,
#+LATEX_HEADER:     colbacktitle=red!20!white
#+LATEX_HEADER: }

#+LATEX_HEADER: \newtcolorbox{TIP}{
#+LATEX_HEADER:     enhanced,
#+LATEX_HEADER:     colback=green!5!white,
#+LATEX_HEADER:     colframe=green!50!black,
#+LATEX_HEADER:     arc=3pt,
#+LATEX_HEADER:     boxrule=0.5pt,
#+LATEX_HEADER:     left=8pt,
#+LATEX_HEADER:     right=8pt,
#+LATEX_HEADER:     title={\textbf{提示}},
#+LATEX_HEADER:     fonttitle=\sffamily\bfseries,
#+LATEX_HEADER:     coltitle=green!80!black,
#+LATEX_HEADER:     colbacktitle=green!20!white
#+LATEX_HEADER: }
#+OPTIONS: toc:2 num:t
#+PROPERTY: header-args:emacs-lisp :tangle config.el
#+LATEX: \newpage


* 自定义函数脚本

本节包含所有自定义的实用函数，用于增强 Emacs 的功能和便利性。

** 终端切换函数
*** toggle-eat
快速切换到 eat 终端并在再次调用时返回之前的缓冲区。

#+begin_src emacs-lisp
(defun toggle-eat ()
  "Toggle between eat terminal and previous buffer. Create eat terminal if not exists."
  (interactive)
  (let ((eat-buffer (get-buffer "*eat*")))
    (if (and eat-buffer (eq (current-buffer) eat-buffer))
        ;; Currently in eat buffer, switch back to previous
        (if (and (boundp 'eat-previous-buffer) 
                 (buffer-live-p eat-previous-buffer))
            (switch-to-buffer eat-previous-buffer)
          (previous-buffer))
      ;; Store current buffer before switching
      (setq eat-previous-buffer (current-buffer))
      ;; Switch to eat or create if not exists  
      (if eat-buffer
          (switch-to-buffer eat-buffer)
        (eat)))))
#+end_src

*** 使用方法
- 键绑定: =C-/=
- 首次按下切换到终端，再次按下返回原缓冲区


** pdf渲染颜色
*** pdf-toggle-theme
将 PDFTools 的配色固定为 doom-one 主题风格。
#+begin_src emacs-lisp
;; PDFTools 固定使用 doom-one 配色
(with-eval-after-load 'pdf-view
  ;; 设置 doom-one 风格的颜色
  (setq pdf-view-midnight-colors '("#FFFFFF" . "#282c34"))
  
  ;; 打开 PDF 时自动启用配色
  (add-hook 'pdf-view-mode-hook
            (lambda ()
              (pdf-view-midnight-minor-mode 1))))

;; 可选：手动切换开关（如果偶尔需要原始颜色）
(defun pdf-toggle-colors ()
  "Toggle PDF midnight mode on/off."
  (interactive)
  (pdf-view-midnight-minor-mode 'toggle)
  (when (derived-mode-p 'pdf-view-mode)
    (pdf-view-redisplay t)))
#+end_src

*** 使用说明
- 自动应用 doom-one 主题配色
- 可选手动切换配色模式
  

  
** 主题自动切换函数
*** load-modus-theme-based-on-time
根据当前时间自动切换 Modus 主题的深色和浅色模式。

#+begin_src emacs-lisp
(defun my/auto-switch-modus-theme ()
  "根据时间自动切换 Modus 主题"
  (let ((hour (string-to-number (format-time-string "%H"))))
    (if (or (>= hour 22) (< hour 6))
        (load-theme 'modus-vivendi-tinted t)
      (load-theme 'modus-operandi-tinted t))))
#+end_src

*** 使用说明
- 22:00-06:00 自动切换为深色主题 (modus-vivendi-tinted)
- 06:00-22:00 自动切换为浅色主题 (modus-operandi-tinted)
- 配合 modus-themes 包使用





** Org 数学预览函数
*** org-math-preview-on-save
在保存 Org 文件时自动预览数学公式（排除 config.org）。

#+begin_src emacs-lisp
(defun my/org-math-preview-on-save ()
  "在保存 Org 文件时自动执行 math-preview-all，排除 config.org."
  (when (and (eq major-mode 'org-mode)
             (not (string-equal (file-name-nondirectory (or buffer-file-name "")) "config.org")))
    (math-preview-all)))

;; 打开 Org 文件时执行
(defun my/org-math-preview-on-open ()
  "打开 Org 文件时自动执行 math-preview-all，排除 config.org."
  (when (not (string-equal (file-name-nondirectory (or buffer-file-name "")) "config.org"))
    (math-preview-all)))

(add-hook 'org-mode-hook #'my/org-math-preview-on-open)
(add-hook 'before-save-hook #'my/org-math-preview-on-save)
#+end_src

*** 使用说明
- 打开 org 文件时自动预览数学公式
- 保存时自动更新预览
- config.org 被排除在外，避免干扰配置文件



** 透明度设置函数
*** set-transparency
根据不同操作系统设置窗口透明度。

#+begin_src emacs-lisp
;; 全局透明度设置
;; 0 = 完全透明，100 = 不透明
(cond
 ;; macOS
 ((eq system-type 'darwin)
  (set-frame-parameter (selected-frame) 'alpha '(100 . 100))
  (add-to-list 'default-frame-alist '(alpha . (100 . 100))))
 ;; Linux
 ((eq system-type 'gnu/linux)
  (set-frame-parameter (selected-frame) 'alpha '(100 . 100)) ; 活动窗口 90%，非活动窗口 85%
  (add-to-list 'default-frame-alist '(alpha . (100 . 100)))))
#+end_src


*** 使用说明
- macOS: 95% 透明度
- Linux: 活动窗口 90%，非活动窗口 85%
- 值范围: 0 (完全透明) - 100 (不透明)



** Copilot 模式切换函数
*** toggle-copilot-mode
快速启用或禁用 Copilot 补全。

#+begin_src emacs-lisp
(defun toggle-copilot-mode ()
  "Toggle copilot-mode on or off."
  (interactive)
  (if (bound-and-true-p copilot-mode)
      (progn
        (copilot-mode -1)
        (message "Copilot mode disabled"))
    (copilot-mode 1)
    (message "Copilot mode enabled")))
#+end_src

*** 使用方法
- 键绑定: =SPC a c t=
- 显示当前状态消息


** Org LaTeX 预览快捷键
*** org-latex-preview-keys
为 Org 模式添加数学公式预览和清除的快捷键。

#+begin_src emacs-lisp
;; 添加到配置中
(with-eval-after-load 'org
  ;; 全局数学公式预览
  (define-key org-mode-map (kbd "C-c C-p")
    (lambda () (interactive) (math-preview-all)))

  ;; 清除所有数学公式预览
  (define-key org-mode-map (kbd "C-c C-r")
    (lambda () (interactive) (math-preview-clear-all))))
#+end_src

*** 使用方法
- =C-c C-p= : 预览所有数学公式
- =C-c C-r= : 清除所有预览



** 自动 Tangle 配置函数
*** auto-tangle-config
保存 config.org 时自动执行 org-babel-tangle 生成 config.el。

#+begin_src emacs-lisp
(defun my/auto-tangle-config ()
  "自动在保存 config.org 时执行 org-babel-tangle。"
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/config.org"))
    (let ((org-confirm-babel-evaluate nil)) ;; 不提示确认
      (org-babel-tangle))))

(add-hook 'after-save-hook #'my/auto-tangle-config)
#+end_src

*** 使用说明
- 保存 config.org 时自动生成 config.el
- 无需手动执行 =org-babel-tangle=
- 不会弹出确认提示



** 文件路径复制函数
*** copy-path
复制当前文件的完整路径或文件名到剪贴板。

#+begin_src emacs-lisp
  (defun copy-file-path ()
  "Copy current file absolute path to clipboard."
  (interactive)
  (let ((file-path (buffer-file-name)))
    (if file-path
        (progn
          (kill-new (expand-file-name file-path))
          (message "Copied: %s" (expand-file-name file-path)))
      (error "Current buffer is not associated with a file"))))

;;;###autoload
(defun copy-file-name ()
  "Copy current file name to clipboard."
  (interactive)
  (let ((file-path (buffer-file-name)))
    (if file-path
        (let ((name (file-name-nondirectory file-path)))
          (kill-new name)
          (message "Copied: %s" name))
      (error "Current buffer is not associated with a file"))))
#+end_src

*** 使用方法
- =M-x copy-file-path= 或 =SPC c p= : 复制完整路径
- =M-x copy-file-name= : 仅复制文件名

** LSP UI 侧边栏切换函数
*** toggle-lsp-ui
切换 lsp-ui-imenu 侧边栏的显示和隐藏。

#+begin_src emacs-lisp
  ;; LSP imenu 切换函数
  (defun my/toggle-lsp-ui-imenu ()
    "Toggle lsp-ui-imenu sidebar."
    (interactive)
    (if (get-buffer-window "*lsp-ui-imenu*")
        (lsp-ui-imenu--kill)
      (lsp-ui-imenu)))
#+end_src

*** 使用方法
- 键绑定: =SPC c s=
- 显示当前文件的符号树结构


** LSP 参数导航函数
这些函数基于 tree-sitter 实现函数参数间的快速跳转。

*** lsp-goto-prev-param
#+begin_src emacs-lisp
;; 参数导航（基于 treesitter）
(defun lsp-goto-next-param ()
  "跳转到下一个参数"
  (interactive)
  (when (bound-and-true-p tree-sitter-mode)
    (let ((node (tsc-get-node-at-point (treesit-node-start (treesit-node-at (point))))))
      (when node
        (treesit-search-forward node "parameter_declaration" t)))))
#+end_src


*** lsp-goto-next-param
跳转到下一个函数参数。

#+begin_src emacs-lisp
(defun lsp-goto-prev-param ()
  "跳转到前一个参数"
  (interactive)
  (when (bound-and-true-p tree-sitter-mode)
    (let ((node (tsc-get-node-at-point (treesit-node-start (treesit-node-at (point))))))
      (when node
        (treesit-search-backward node "parameter_declaration" t)))))
#+end_src

*** 使用说明
- 需要启用 tree-sitter 模式
- 用于在函数参数之间快速导航


 

** 智能 Tab 键函数
