config.el
(defun toggle-eat ()
  "Toggle between eat terminal and previous buffer. Create eat terminal if not exists."
  (interactive)
  (let ((eat-buffer (get-buffer "*eat*")))
    (if (and eat-buffer (eq (current-buffer) eat-buffer))
        ;; Currently in eat buffer, switch back to previous
        (if (and (boundp 'eat-previous-buffer) 
                 (buffer-live-p eat-previous-buffer))
            (switch-to-buffer eat-previous-buffer)
          (previous-buffer))
      ;; Store current buffer before switching
      (setq eat-previous-buffer (current-buffer))
      ;; Switch to eat or create if not exists  
      (if eat-buffer
          (switch-to-buffer eat-buffer)
        (eat)))))

;; PDFTools 固定使用 doom-one 配色
(with-eval-after-load 'pdf-view
  ;; 设置 doom-one 风格的颜色
  (setq pdf-view-midnight-colors '("#FFFFFF" . "#282c34"))
  
  ;; 打开 PDF 时自动启用配色
  (add-hook 'pdf-view-mode-hook
            (lambda ()
              (pdf-view-midnight-minor-mode 1))))

;; 可选：手动切换开关（如果偶尔需要原始颜色）
(defun pdf-toggle-colors ()
  "Toggle PDF midnight mode on/off."
  (interactive)
  (pdf-view-midnight-minor-mode 'toggle)
  (when (derived-mode-p 'pdf-view-mode)
    (pdf-view-redisplay t)))

(defun my/auto-switch-modus-theme ()
  "根据时间自动切换 Modus 主题"
  (let ((hour (string-to-number (format-time-string "%H"))))
    (if (or (>= hour 22) (< hour 6))
        (load-theme 'modus-vivendi-tinted t)
      (load-theme 'modus-operandi-tinted t))))

(defun my/org-math-preview-on-save ()
  "在保存 Org 文件时自动执行 math-preview-all，排除 config.org."
  (when (and (eq major-mode 'org-mode)
             (not (string-equal (file-name-nondirectory (or buffer-file-name "")) "config.org")))
    (math-preview-all)))

;; 打开 Org 文件时执行
(defun my/org-math-preview-on-open ()
  "打开 Org 文件时自动执行 math-preview-all，排除 config.org."
  (when (not (string-equal (file-name-nondirectory (or buffer-file-name "")) "config.org"))
    (math-preview-all)))

(add-hook 'org-mode-hook #'my/org-math-preview-on-open)
(add-hook 'before-save-hook #'my/org-math-preview-on-save)

;; 全局透明度设置
;; 0 = 完全透明，100 = 不透明
(cond
 ;; macOS
 ((eq system-type 'darwin)
  (set-frame-parameter (selected-frame) 'alpha '(100 . 100))
  (add-to-list 'default-frame-alist '(alpha . (100 . 100))))
 ;; Linux
 ((eq system-type 'gnu/linux)
  (set-frame-parameter (selected-frame) 'alpha '(100 . 100)) ; 活动窗口 90%，非活动窗口 85%
  (add-to-list 'default-frame-alist '(alpha . (100 . 100)))))

(defun toggle-copilot-mode ()
  "Toggle copilot-mode on or off."
  (interactive)
  (if (bound-and-true-p copilot-mode)
      (progn
        (copilot-mode -1)
        (message "Copilot mode disabled"))
    (copilot-mode 1)
    (message "Copilot mode enabled")))

;; 添加到配置中
(with-eval-after-load 'org
  ;; 全局数学公式预览
  (define-key org-mode-map (kbd "C-c C-p")
    (lambda () (interactive) (math-preview-all)))

  ;; 清除所有数学公式预览
  (define-key org-mode-map (kbd "C-c C-r")
    (lambda () (interactive) (math-preview-clear-all))))

(defun my/auto-tangle-config ()
  "自动在保存 config.org 时执行 org-babel-tangle。"
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/config.org"))
    (let ((org-confirm-babel-evaluate nil)) ;; 不提示确认
      (org-babel-tangle))))

(add-hook 'after-save-hook #'my/auto-tangle-config)

  (defun copy-file-path ()
  "Copy current file absolute path to clipboard."
  (interactive)
  (let ((file-path (buffer-file-name)))
    (if file-path
        (progn
          (kill-new (expand-file-name file-path))
          (message "Copied: %s" (expand-file-name file-path)))
      (error "Current buffer is not associated with a file"))))

;;;###autoload
(defun copy-file-name ()
  "Copy current file name to clipboard."
  (interactive)
  (let ((file-path (buffer-file-name)))
    (if file-path
        (let ((name (file-name-nondirectory file-path)))
          (kill-new name)
          (message "Copied: %s" name))
      (error "Current buffer is not associated with a file"))))

  ;; LSP imenu 切换函数
  (defun my/toggle-lsp-ui-imenu ()
    "Toggle lsp-ui-imenu sidebar."
    (interactive)
    (if (get-buffer-window "*lsp-ui-imenu*")
        (lsp-ui-imenu--kill)
      (lsp-ui-imenu)))

;; 参数导航（基于 treesitter）
(defun lsp-goto-next-param ()
  "跳转到下一个参数"
  (interactive)
  (when (bound-and-true-p tree-sitter-mode)
    (let ((node (tsc-get-node-at-point (treesit-node-start (treesit-node-at (point))))))
      (when node
        (treesit-search-forward node "parameter_declaration" t)))))

(defun lsp-goto-prev-param ()
  "跳转到前一个参数"
  (interactive)
  (when (bound-and-true-p tree-sitter-mode)
    (let ((node (tsc-get-node-at-point (treesit-node-start (treesit-node-at (point))))))
      (when node
        (treesit-search-backward node "parameter_declaration" t)))))
