config.org
*** smart-tab
智能 TAB 键实现，优先级：YASnippet > Copilot > 普通缩进。

#+begin_src emacs-lisp
;; 清空所有 Shift-TAB 绑定
(with-eval-after-load 'company
  (define-key company-active-map (kbd "S-TAB") nil)
  (define-key company-active-map (kbd "<backtab>") nil))

(with-eval-after-load 'yasnippet
  (define-key yas-minor-mode-map (kbd "S-TAB") nil)
  (define-key yas-minor-mode-map (kbd "<backtab>") nil))

;; 清空 company 的 TAB 绑定
(with-eval-after-load 'company
  (define-key company-active-map (kbd "TAB") nil)
  (define-key company-active-map (kbd "<tab>") nil))

;; 清空 yasnippet 的 TAB 绑定
(with-eval-after-load 'yasnippet
  (define-key yas-minor-mode-map (kbd "TAB") nil)
  (define-key yas-minor-mode-map (kbd "<tab>") nil))

;; 定义智能 Shift-TAB：仅 YASnippet 反向跳转
(defun smart-shift-tab ()
  "Shift-TAB：仅用于 YASnippet 反向跳转"
  (interactive)
  (when (and (bound-and-true-p yas-minor-mode)
             (yas-active-snippets))
    (yas-prev-field)))

;; 绑定 Shift-TAB
(global-set-key (kbd "<backtab>") 'smart-shift-tab)

(defun smart-tab ()
  "智能 TAB 键：优先展开/跳转 YASnippet，其次 Copilot，最后正常 TAB。"
  (interactive)
  (cond
   ;; 1. 如果光标在 snippet 缩写词后，尝试展开
   ((and (bound-and-true-p yas-minor-mode)
         (yas-expand)))
   
   ;; 2. 如果有激活的 snippet，占位符跳转
   ((and (bound-and-true-p yas-minor-mode)
         (yas-active-snippets))
    (let ((field (yas--snippet-active-field (car (yas-active-snippets)))))
      (if (and field (yas--field-next field))
          (yas-next-field)
        (yas-exit-all-snippets))))
   
   ;; 3. 如果 Copilot 有建议，接受建议
   ((and (bound-and-true-p copilot-mode)
         (copilot--overlay-visible))
    (copilot-accept-completion))
   
   ;; 4. 否则执行正常的 TAB 缩进
   (t
    (indent-for-tab-command))))

#+end_src

*** 使用说明
- =TAB= : 根据上下文智能选择行为
  1. 如果是 snippet 缩写，则展开
  2. 如果在 snippet 中，则跳转到下一个字段
  3. 如果 Copilot 有建议，则接受建议
  4. 否则执行普通缩进
- =Shift-TAB= : YASnippet 反向跳转



* 包管理系统

本配置使用 straight.el 作为包管理器，配合 use-package 进行声明式配置。straight.el 直接从 Git 仓库克隆包，支持版本锁定和可重现构建。

** straight.el
*** 介绍
straight.el 是一个功能强大的现代化包管理器，从 Git 仓库直接克隆和构建包。相比传统的 package.el：
- 支持版本锁定（lockfiles）确保环境可重现
- 可以直接修改包源码
- 从任何 Git 仓库安装包，不限于 ELPA
- 完全透明，所有包源码都在 =~/.emacs.d/straight/repos/=

*** 相关链接
- GitHub: https://github.com/radian-software/straight.el
- 文档: https://github.com/radian-software/straight.el/blob/develop/README.md

*** 使用方法
#+BEGIN_SRC emacs-lisp
  ;; straight.el 已在 init.el 中初始化
  ;; 这里配置 use-package 的默认行为

  (setq use-package-always-defer t)  ; 延迟加载，提高启动速度
#+END_SRC

*** 常用命令
- =M-x straight-pull-all= : 更新所有包
- =M-x straight-rebuild-all= : 重新构建所有包
- =M-x straight-freeze-versions= : 创建版本锁定文件
- =M-x straight-check-all= : 检查所有包状态

** use-package
*** 介绍
use-package 是一个声明式包配置宏，简化包的安装、配置和延迟加载。它提供统一的配置语法，支持条件加载、键绑定、hooks 等功能。

*** 相关链接
- GitHub: https://github.com/jwiegley/use-package
- 文档: https://github.com/jwiegley/use-package/blob/master/README.md

*** 配置说明
本配置已设置 =straight-use-package-by-default t= ，所有 use-package 声明会自动使用 straight.el 安装包。


* 界面美化
提升 Emacs 的视觉体验，包括主题、状态栏、标签栏、图标等。
** 基础设置

*** 字体配置
#+BEGIN_SRC emacs-lisp
;; 设置编程字体
(set-face-attribute 'default nil
                    :font "Iosevka Nerd Font"
                    :height 155)

;; Set Chinese font for Han script
(set-fontset-font t 'han "Noto Serif CJK SC")
#+END_SRC


*** UI 元素配置
#+BEGIN_SRC emacs-lisp
  ;; 关闭不必要的 UI 元素
  (tool-bar-mode -1)        ; 关闭工具栏
  (scroll-bar-mode -1)      ; 关闭滚动条
  (menu-bar-mode -1)        ; 关闭菜单栏

  ;; 启用有用的 UI 功能
  (global-display-line-numbers-mode 1)  ; 显示行号
  (global-visual-line-mode 1)           ; 视觉行模式，软换行
  (global-hl-line-mode 1)               ; 高亮当前行

  ;; 启动配置
  (setq inhibit-startup-message t)      ; 关闭启动画面
#+END_SRC

** dashboard
:PROPERTIES:
:ID:       83bfbb2c-92ce-481f-ac5e-c1a764e7c123
:END:

#+begin_src emacs-lisp
(use-package dashboard
  :straight t
  :demand t
  :after (centaur-tabs nerd-icons evil)
  
  :custom
  ;; 基础设置
  (dashboard-banner-logo-title (format "GNU Emacs %s" emacs-version))
  (dashboard-startup-banner 'logo)
  (dashboard-center-content t)
  (dashboard-show-shortcuts t)
  (dashboard-items-default-length 20)
  (initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
  
  ;; 显示项目
  (dashboard-items '((recents . 5) 
                     (bookmarks . 5) 
                     (projects . 5) 
                     (agenda . 5)))
  (dashboard-item-shortcuts '((recents . "r") 
                              (bookmarks . "m") 
                              (agenda . "a") 
                              (projects . "p")))
  
  ;; Agenda
  (dashboard-week-agenda t)
  (dashboard-filter-agenda-entry 'dashboard-no-filter-agenda)
  
  ;; 图标
  (dashboard-set-heading-icons t)
  (dashboard-set-file-icons t)
  (dashboard-icon-type 'nerd-icons)
  (dashboard-display-icons-p t)
  
  ;; Footer
  (dashboard-set-init-info t)
  (dashboard-set-footer t)
  (dashboard-footer-messages '("Happy Hacking!"))
  (dashboard-footer-icon (nerd-icons-faicon "nf-fa-heart" 
                                           :height 1.1 
                                           :v-adjust -0.05 
                                           :face 'error))
  
  :init
  ;; 导航按钮
  (setq dashboard-navigator-buttons
        `(((,(nerd-icons-faicon "nf-fa-github" :height 1.1 :v-adjust 0.0)
            "GitHub" "Browse" 
            (lambda (&rest _) (browse-url "https://github.com")))
           
           (,(nerd-icons-octicon "nf-oct-gear" :height 1.1 :v-adjust 0.0)
            "Config" "Edit" 
            (lambda (&rest _) 
              (find-file (expand-file-name "config.org" user-emacs-directory))))
           
           (,(nerd-icons-faicon "nf-fa-refresh" :height 1.1 :v-adjust 0.0)
            "Update" "Packages" 
            (lambda (&rest _) (straight-pull-all))))))
  
  :config
  (setq dashboard-image-banner-max-height 300)
  (setq dashboard-image-banner-max-width 300)
  (setq dashboard-startup-banner "~/.emacs.d/berserk.png")
  (dashboard-setup-startup-hook)
  
  ;; 隐藏 centaur-tabs
  (add-to-list 'centaur-tabs-excluded-prefixes "*dashboard")
  
  ;; Evil 键绑定
  (evil-set-initial-state 'dashboard-mode 'normal)
  (evil-define-key 'normal dashboard-mode-map
    "r" #'dashboard-jump-to-recents
    "m" #'dashboard-jump-to-bookmarks
    "p" #'dashboard-jump-to-projects
    "a" #'dashboard-jump-to-agenda
    "g" #'dashboard-refresh-buffer
    "q" #'quit-window
    "{" #'dashboard-previous-section
    "}" #'dashboard-next-section
    "j" #'widget-forward
    "k" #'widget-backward
    (kbd "RET") #'widget-button-press))

;; Org-agenda 基础配置
(use-package org
  :defer t
  :init
  (let ((org-dir (expand-file-name "~/org")))
    (unless (file-directory-p org-dir) 
      (make-directory org-dir t)))
  
  :custom
  (org-agenda-files (list (expand-file-name "~/org")))
  (org-agenda-start-on-weekday nil)
  (org-agenda-span 7))
#+end_src


** colorful-mode
*** 介绍
colorful-mode 在代码中直接显示颜色值的实际颜色，支持 HEX、RGB、HSL 等多种格式。对前端开发和主题配置特别有用。

*** 相关链接
- GitHub: https://github.com/DevelopmentCool2449/colorful-mode

*** 配置
#+begin_src emacs-lisp
(use-package colorful-mode
  :straight t
  :custom
  (colorful-use-prefix t)
  (colorful-only-strings nil)   ;; 全局显示颜色，不仅限字符串
  (css-fontify-colors nil)
  :init
  ;; 每次 buffer 切换或打开都自动启用 colorful-mode
  (add-hook 'after-change-major-mode-hook #'colorful-mode))
#+end_src




*** 使用方法
- 在代码中输入颜色值（如 #FF5733）会自动显示颜色
- 支持编程模式下的字符串内颜色显示

** doom-themes
*** 介绍
doom-themes 是一个丰富的主题集合，包含 25+ 个精心设计的高对比度主题。支持深色和浅色模式，为 org-mode、treemacs、magit 等常用模式做了特别优化。

*** 相关链接
- GitHub: https://github.com/doomemacs/themes
- 主题预览: https://github.com/doomemacs/themes/tree/screenshots

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package doom-themes
  :straight t
  :init
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t)
  (load-theme 'doom-one t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (nerd-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))
#+END_SRC


*** 使用方法
- 更换主题: =M-x load-theme RET doom-<主题名> RET=
- 推荐主题: doom-one, doom-molokai, doom-nord, doom-tomorrow-night

** modus-themes
*** 介绍
Modus 是 Emacs 内置的高对比度主题集，由 Protesilaos Stavrou 开发。提供深色 (vivendi) 和浅色 (operandi) 两个变体，符合 WCAG AAA 无障碍标准，适合长时间阅读和编程。

*** 相关链接
- 官网: https://protesilaos.com/emacs/modus-themes
- 手册: https://protesilaos.com/emacs/modus-themes

*** 配置
#+begin_src emacs-lisp
;; (use-package modus-themes
;;   :straight t
;;   :init
;;   (my/auto-switch-modus-theme)
;;   (run-at-time "00:00" 3600 #'my/auto-switch-modus-theme)
;;   (run-at-time "06:00" 86400 #'my/auto-switch-modus-theme)  ; 每天早上6点
;;   (run-at-time "22:00" 86400 #'my/auto-switch-modus-theme)) ; 每天晚上10点
#+end_src

*** 使用方法
- 自动根据时间切换主题（22:00-06:00 深色，06:00-22:00 浅色）
- 手动切换: =M-x load-theme RET modus-vivendi RET= 或 =modus-operandi=





** keycast
*** 介绍
显示实时按键输入，用于教学、录屏或调试键绑定。

*** 相关链接
- GitHub: https://github.com/tarsius/keycast

*** 配置
#+BEGIN_SRC emacs-lisp
  (use-package keycast
    :straight t
    :init
    (add-to-list 'global-mode-string '("" keycast-mode-line))
    (keycast-mode-line-mode t))
#+END_SRC

** doom-modeline
*** 介绍
doom-modeline 是一个现代化的状态栏（mode-line），显示 Git 分支、LSP 状态、文件编码、行号等信息。比内置 mode-line 更美观，信息密度更高。

*** 相关链接
- GitHub: https://github.com/seagle0128/doom-modeline
- 文档: https://github.com/seagle0128/doom-modeline/blob/master/README.md

