config.el

;; 清空所有 Shift-TAB 绑定
(with-eval-after-load 'company
  (define-key company-active-map (kbd "S-TAB") nil)
  (define-key company-active-map (kbd "<backtab>") nil))

(with-eval-after-load 'yasnippet
  (define-key yas-minor-mode-map (kbd "S-TAB") nil)
  (define-key yas-minor-mode-map (kbd "<backtab>") nil))

;; 清空 company 的 TAB 绑定
(with-eval-after-load 'company
  (define-key company-active-map (kbd "TAB") nil)
  (define-key company-active-map (kbd "<tab>") nil))

;; 清空 yasnippet 的 TAB 绑定
(with-eval-after-load 'yasnippet
  (define-key yas-minor-mode-map (kbd "TAB") nil)
  (define-key yas-minor-mode-map (kbd "<tab>") nil))

;; 定义智能 Shift-TAB：仅 YASnippet 反向跳转
(defun smart-shift-tab ()
  "Shift-TAB：仅用于 YASnippet 反向跳转"
  (interactive)
  (when (and (bound-and-true-p yas-minor-mode)
             (yas-active-snippets))
    (yas-prev-field)))

;; 绑定 Shift-TAB
(global-set-key (kbd "<backtab>") 'smart-shift-tab)

(defun smart-tab ()
  "智能 TAB 键：优先展开/跳转 YASnippet，其次 Copilot，最后正常 TAB。"
  (interactive)
  (cond
   ;; 1. 如果光标在 snippet 缩写词后，尝试展开
   ((and (bound-and-true-p yas-minor-mode)
         (yas-expand)))
   
   ;; 2. 如果有激活的 snippet，占位符跳转
   ((and (bound-and-true-p yas-minor-mode)
         (yas-active-snippets))
    (let ((field (yas--snippet-active-field (car (yas-active-snippets)))))
      (if (and field (yas--field-next field))
          (yas-next-field)
        (yas-exit-all-snippets))))
   
   ;; 3. 如果 Copilot 有建议，接受建议
   ((and (bound-and-true-p copilot-mode)
         (copilot--overlay-visible))
    (copilot-accept-completion))
   
   ;; 4. 否则执行正常的 TAB 缩进
   (t
    (indent-for-tab-command))))

  ;; straight.el 已在 init.el 中初始化
  ;; 这里配置 use-package 的默认行为

  (setq use-package-always-defer t)  ; 延迟加载，提高启动速度

;; 设置编程字体
(set-face-attribute 'default nil
                    :font "Iosevka Nerd Font"
                    :height 155)

;; Set Chinese font for Han script
(set-fontset-font t 'han "Noto Serif CJK SC")

  ;; 关闭不必要的 UI 元素
  (tool-bar-mode -1)        ; 关闭工具栏
  (scroll-bar-mode -1)      ; 关闭滚动条
  (menu-bar-mode -1)        ; 关闭菜单栏

  ;; 启用有用的 UI 功能
  (global-display-line-numbers-mode 1)  ; 显示行号
  (global-visual-line-mode 1)           ; 视觉行模式，软换行
  (global-hl-line-mode 1)               ; 高亮当前行

  ;; 启动配置
  (setq inhibit-startup-message t)      ; 关闭启动画面

(use-package dashboard
  :straight t
  :demand t
  :after (centaur-tabs nerd-icons evil)
  
  :custom
  ;; 基础设置
  (dashboard-banner-logo-title (format "GNU Emacs %s" emacs-version))
  (dashboard-startup-banner 'logo)
  (dashboard-center-content t)
  (dashboard-show-shortcuts t)
  (dashboard-items-default-length 20)
  (initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
  
  ;; 显示项目
  (dashboard-items '((recents . 5) 
                     (bookmarks . 5) 
                     (projects . 5) 
                     (agenda . 5)))
  (dashboard-item-shortcuts '((recents . "r") 
                              (bookmarks . "m") 
                              (agenda . "a") 
                              (projects . "p")))
  
  ;; Agenda
  (dashboard-week-agenda t)
  (dashboard-filter-agenda-entry 'dashboard-no-filter-agenda)
  
  ;; 图标
  (dashboard-set-heading-icons t)
  (dashboard-set-file-icons t)
  (dashboard-icon-type 'nerd-icons)
  (dashboard-display-icons-p t)
  
  ;; Footer
  (dashboard-set-init-info t)
  (dashboard-set-footer t)
  (dashboard-footer-messages '("Happy Hacking!"))
  (dashboard-footer-icon (nerd-icons-faicon "nf-fa-heart" 
                                           :height 1.1 
                                           :v-adjust -0.05 
                                           :face 'error))
  
  :init
  ;; 导航按钮
  (setq dashboard-navigator-buttons
        `(((,(nerd-icons-faicon "nf-fa-github" :height 1.1 :v-adjust 0.0)
            "GitHub" "Browse" 
            (lambda (&rest _) (browse-url "https://github.com")))
           
           (,(nerd-icons-octicon "nf-oct-gear" :height 1.1 :v-adjust 0.0)
            "Config" "Edit" 
            (lambda (&rest _) 
              (find-file (expand-file-name "config.org" user-emacs-directory))))
           
           (,(nerd-icons-faicon "nf-fa-refresh" :height 1.1 :v-adjust 0.0)
            "Update" "Packages" 
            (lambda (&rest _) (straight-pull-all))))))
  
  :config
  (setq dashboard-image-banner-max-height 300)
  (setq dashboard-image-banner-max-width 300)
  (setq dashboard-startup-banner "~/.emacs.d/berserk.png")
  (dashboard-setup-startup-hook)
  
  ;; 隐藏 centaur-tabs
  (add-to-list 'centaur-tabs-excluded-prefixes "*dashboard")
  
  ;; Evil 键绑定
  (evil-set-initial-state 'dashboard-mode 'normal)
  (evil-define-key 'normal dashboard-mode-map
    "r" #'dashboard-jump-to-recents
    "m" #'dashboard-jump-to-bookmarks
    "p" #'dashboard-jump-to-projects
    "a" #'dashboard-jump-to-agenda
    "g" #'dashboard-refresh-buffer
    "q" #'quit-window
    "{" #'dashboard-previous-section
    "}" #'dashboard-next-section
    "j" #'widget-forward
    "k" #'widget-backward
    (kbd "RET") #'widget-button-press))

;; Org-agenda 基础配置
(use-package org
  :defer t
  :init
  (let ((org-dir (expand-file-name "~/org")))
    (unless (file-directory-p org-dir) 
      (make-directory org-dir t)))
  
  :custom
  (org-agenda-files (list (expand-file-name "~/org")))
  (org-agenda-start-on-weekday nil)
  (org-agenda-span 7))

(use-package colorful-mode
  :straight t
  :custom
  (colorful-use-prefix t)
  (colorful-only-strings nil)   ;; 全局显示颜色，不仅限字符串
  (css-fontify-colors nil)
  :init
  ;; 每次 buffer 切换或打开都自动启用 colorful-mode
  (add-hook 'after-change-major-mode-hook #'colorful-mode))

(use-package doom-themes
  :straight t
  :init
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t)
  (load-theme 'doom-one t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (nerd-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

;; (use-package modus-themes
;;   :straight t
;;   :init
;;   (my/auto-switch-modus-theme)
;;   (run-at-time "00:00" 3600 #'my/auto-switch-modus-theme)
;;   (run-at-time "06:00" 86400 #'my/auto-switch-modus-theme)  ; 每天早上6点
;;   (run-at-time "22:00" 86400 #'my/auto-switch-modus-theme)) ; 每天晚上10点

  (use-package keycast
    :straight t
    :init
    (add-to-list 'global-mode-string '("" keycast-mode-line))
    (keycast-mode-line-mode t))
