config.org
*** 配置
#+BEGIN_SRC emacs-lisp
(use-package doom-modeline
  :straight t
  :hook (after-init . doom-modeline-mode)
  :config
  (setq doom-modeline-height 25         ; 状态栏高度
        doom-modeline-bar-width 3))     ; 左侧条宽度
#+END_SRC

*** 使用方法
状态栏会自动显示当前缓冲区信息，无需手动操作。

** centaur-tabs
*** 介绍
centaur-tabs 提供类似浏览器的标签栏，支持标签分组、图标显示、自定义样式。可以按项目或模式分组缓冲区，方便多文件管理。

*** 相关链接
- GitHub: https://github.com/ema2159/centaur-tabs

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package centaur-tabs
  :straight t
  :demand t
  :config
  ;; 基础配置
  (setq centaur-tabs-set-bar 'left
        centaur-tabs-style "bar"
        centaur-tabs-set-icons t
        centaur-tabs-gray-out-icons 'buffer
        centaur-tabs-icon-type 'nerd-icons
        centaur-tabs-set-modified-marker t)
  
  ;; 计数函数
  (defun my/count-file-buffers ()
    "计算打开的文件 buffer 数量"
    (length (cl-remove-if-not 'buffer-file-name (buffer-list))))
  
  ;; 更新显示
  (defun my/update-tabs-visibility ()
    "2个或以上文件才显示 tabs"
    (let ((count (my/count-file-buffers)))
      (if (>= count 2)
          (unless centaur-tabs-mode (centaur-tabs-mode 1))
        (when centaur-tabs-mode (centaur-tabs-mode -1)))))
  
  ;; 监听 buffer 变化
  (add-hook 'buffer-list-update-hook 'my/update-tabs-visibility)
  
  ;; 初始检查
  (run-with-idle-timer 0.5 nil 'my/update-tabs-visibility))
#+END_SRC

*** 使用方法
- 切换标签: =H= (前一个), =L= (后一个) - 需在 Evil 模式下
- 切换分组: =SPC f t=

** indent-bars
*** 介绍
indent-bars 在代码中显示缩进参考线，支持 tree-sitter，帮助识别代码块层级。对 Python 等缩进敏感的语言特别有用。

*** 相关链接
- GitHub: https://github.com/jdtsmith/indent-bars

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package indent-bars
  :straight t
  :custom
  (indent-bars-no-descend-lists t)                    ; 列表不显示额外缩进线
  (indent-bars-treesit-support t)                     ; 启用 tree-sitter 支持
  (indent-bars-treesit-ignore-blank-lines-types '("module"))
  (indent-bars-treesit-scope '((python function_definition class_definition 
                                       for_statement if_statement 
                                       with_statement while_statement)))
  :hook ((java-ts-mode python-ts-mode yaml-mode c++-ts-mode) . indent-bars-mode))
#+END_SRC

*** 使用方法
在支持的模式下自动启用，无需手动操作。

** all-the-icons
*** 介绍
all-the-icons 提供 1000+ 个图标，用于美化文件浏览器、dired、mode-line 等。是许多 UI 插件的基础依赖。

*** 相关链接
- GitHub: https://github.com/domtronn/all-the-icons.el

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package all-the-icons
  :straight t
  :if (display-graphic-p))
#+END_SRC

*** 使用方法
- 首次使用需安装字体: =M-x all-the-icons-install-fonts=

** nerd-icons
*** 介绍
nerd-icons 是 all-the-icons 的现代化版本，支持最新的 Nerd Fonts 图标集，性能更好，图标更丰富。

*** 相关链接
- GitHub: https://github.com/rainstormstudio/nerd-icons.el

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package nerd-icons
  :straight t
  :defer t
  :if (display-graphic-p))
#+END_SRC

*** 使用方法
- 安装字体: =M-x nerd-icons-install-fonts=

** nerd-icons-completion
*** 介绍
为补全界面（如 Vertico）添加图标支持，使补全列表更加直观美观。

*** 相关链接
- GitHub: https://github.com/rainstormstudio/nerd-icons-completion

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package nerd-icons-completion
  :straight t
  :after marginalia
  :hook (after-init . nerd-icons-completion-mode)
  :hook (marginalia-mode . nerd-icons-completion-marginalia-setup))
#+END_SRC

** neotree
*** 介绍
neotree 是一个侧边文件树浏览器，类似 VS Code 的资源管理器，支持 Git 状态图标、文件操作等。

*** 相关链接
- GitHub: https://github.com/jaypei/emacs-neotree

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package neotree
  :straight t
  :hook (after-init . (lambda ()
                        (global-set-key [f3] 'neotree-toggle)))
  :config
  (setq neo-window-width 40)  ; 设置固定宽度为30列
  (setq neo-smart-open t)  ; 自动展开到当前文件
  (setq neo-theme (if (display-graphic-p) 'nerd-icons 'arrow))
  
  ;; 禁止换行，截断长文件名
  (setq neo-window-fixed-size nil)  ; 允许窗口宽度调整
  (add-hook 'neo-after-create-hook
            (lambda (&rest _)
              (setq truncate-lines t)  ; 截断长行，不换行
              (setq word-wrap nil))))  ; 禁用自动换行
#+END_SRC

*** 使用方法
- 打开/关闭: =F3= 或 =SPC e=
- 在 neotree 中:
  - =h= : 上一级目录
  - =l= : 进入目录或打开文件
  - =q= : 关闭 neotree
  - =a= : 创建文件
  - =d= : 删除文件
  - =r= : 重命名文件


* 编辑增强

提升文本编辑体验，包括 Vim 模拟、自动补全、代码片段等。

** 基础编辑设置
#+BEGIN_SRC emacs-lisp
      ;; 编辑体验优化
      (auto-save-visited-mode 1)           ; 自动保存
      (show-paren-mode 1)                  ; 高亮匹配括号
      (global-auto-revert-mode 1)          ; 自动重新加载外部修改的文件
      (delete-selection-mode 1)            ; 选中文字后输入会替换
      (recentf-mode 1)                     ; 最近文件列表

      ;; 启用相对行号
      (global-display-line-numbers-mode 1)
      (setq display-line-numbers-type 'relative)

      ;; 将 yes-or-no-p 替换为 y-or-n-p
      (defalias 'yes-or-no-p 'y-or-n-p)
      ;; 关闭备份文件
      (setq make-backup-files nil)         ; 不创建 ~ 备份文件
      (setq auto-save-default nil)         ; 不创建 # 自动保存文件
#+END_SRC


** sis-change-input-method
*** 介绍
sis (Smart Input Source) 智能输入法管理工具，自动在不同模式和上下文中切换输入法。支持 macOS 和 Linux (fcitx5)，提供 inline、context、respect 等多种模式。

*** 相关链接
- GitHub: https://github.com/laishulu/emacs-smart-input-source

*** 配置
#+begin_src emacs-lisp
(use-package sis
  :straight t
  :init
  ;; macOS 配置
  (when (eq system-type 'darwin)
    (sis-ism-lazyman-config
     "com.apple.keylayout.ABC"
     "com.tencent.inputmethod.wetype.pinyin"
     'macOS))
  
  ;; Linux 配置
  (when (eq system-type 'gnu/linux)
    (sis-ism-lazyman-config "1" "2" 'fcitx5))
  
  ;; 启用功能
  (sis-global-cursor-color-mode t)
  (sis-global-respect-mode t)     ; 不用这个，会强制切英文
  (sis-global-context-mode t)        ; 这个会根据上下文智能切换，保持输入法
  (sis-global-inline-mode t))
#+end_src

*** 使用说明
- macOS 配置为 ABC 英文和微信输入法
- Linux 配置为 fcitx5
- 启用光标颜色模式：不同输入法显示不同光标颜色
- respect 模式：在切换 buffer 时保持之前的输入法状态
- inline 模式：在行内自动切换输入法

** savehist
*** 介绍
savehist 是 Emacs 内置包，用于保存 minibuffer 历史记录。让你在重启 Emacs 后仍能使用之前的命令历史、搜索历史等。

*** 配置
#+begin_src emacs-lisp
(use-package savehist
  :hook (after-init . savehist-mode)
  :config
  (setq history-length 1000                     ;; 保存历史条目数
        savehist-autosave-interval 300         ;; 自动保存间隔（秒）
        savehist-additional-variables '(kill-ring search-ring regexp-search-ring)))                            ;; 启用 savehist
#+end_src

*** 使用说明
- 保存最近 1000 条历史记录
- 每 5 分钟自动保存一次
- 额外保存 kill-ring 和搜索历史



** saveplace
*** 介绍
saveplace 是 Emacs 内置包，记住每个文件上次访问时光标的位置。重新打开文件时自动跳转到上次的位置。

*** 配置
#+begin_src emacs-lisp
(use-package saveplace
  :hook (after-init . save-place-mode)
  :config
  (setq save-place-file (expand-file-name "saveplace" user-emacs-directory)))                           ;; 启用 saveplace
#+end_src

*** 使用说明
- 自动保存每个文件的光标位置
- 数据保存在 ~/.emacs.d/saveplace 文件中


** magit
*** 介绍
Magit 是 Emacs 中最强大的 Git 客户端，提供完整的 Git 功能界面。通过直观的菜单和快捷键，可以执行所有 Git 操作，包括 commit、branch、merge、rebase 等。

*** 相关链接
- 官网: https://magit.vc/
- 手册: https://magit.vc/manual/

*** 配置
#+begin_src emacs-lisp
(use-package magit
  :config
  ;; 可选配置
  (setq magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

*** 使用方法
- 键绑定: =SPC g g= 打开 Magit 状态界面
- 在 Magit 界面中:
  - =s= : stage 文件
  - =u= : unstage 文件
  - =c= : commit 菜单
  - =P= : push 菜单
  - =F= : pull 菜单
  - =b= : branch 菜单
  - =l= : log 菜单
  - =?= : 显示帮助


** blamer
*** 介绍
blamer.el 在代码行尾显示 Git 提交信息（作者、时间、提交摘要）。帮助快速了解代码变更历史，类似 VS Code 的 GitLens 插件。
*** 相关链接
- GitHub: https://github.com/APRhum/blamer.el
*** 配置

#+begin_src emacs-lisp
(use-package blamer
  :straight (:host github :repo "artawower/blamer.el")
  :custom
  (blamer-idle-time 0.3)
  (blamer-min-offset 70)
  :custom-face
  (blamer-face ((t :foreground "#7a88cf"
                    :background unspecified
                    :height 140
                    :italic t)))
  :init
  (setq blamer-commit-formatter " ● %s")
  (setq blamer-author-formatter "  ✎ %s ")
  (global-blamer-mode 0))
#+end_src

*** 使用方法
- 自动在代码行尾显示 Git 提交信息
- =s-i= : 显示当前行的完整提交信息弹窗


** diff-hl
*** 介绍
diff-hl 在编辑器边缘（fringe）显示 Git 差异标记，实时显示文件的修改、添加、删除行。支持与 Magit 集成，提供即时的版本控制反馈。flydiff 模式可以在编辑时实时更新差异标记。

*** 相关链接
- GitHub: https://github.com/dgutov/diff-hl

*** 配置
#+begin_src emacs-lisp
(use-package diff-hl
  :straight t
  :init
  (diff-hl-flydiff-mode)
  (global-diff-hl-mode))
#+end_src

*** 使用方法
- 在 fringe 自动显示 Git 差异标记
- 绿色: 新增行
- 蓝色: 修改行
- 红色: 删除行
- =M-x diff-hl-diff-goto-hunk= : 跳转到差异处
- =M-x diff-hl-revert-hunk= : 还原当前修改块

** pdf-tools
*** 介绍
pdf-tools 是 Emacs 的强大 PDF 阅读器，提供比 DocView 更好的性能和功能。支持注释、搜索、链接跳转、夜间模式等。

*** 相关链接
- GitHub: https://github.com/vedang/pdf-tools

*** 配置
#+begin_src emacs-lisp
(use-package pdf-tools
  :straight t
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :init
  (setq pdf-view-display-size 'fit-page
        pdf-view-incompatible-modes
        '(display-line-numbers-mode hl-line-mode visual-line-mode)
        ;; 禁用 pdf-view 的警告
        warning-suppress-types '((pdf-view)))
  :config
  ;; 自动安装 pdf-tools（若 pdf-info 未运行）
  (unless (pdf-info-running-p)
    (pdf-tools-install-noverify))

  ;; 进入 pdf-view-mode 时自动调整显示、关闭不兼容模式
  (add-hook 'pdf-view-mode-hook
            (lambda ()
              (display-line-numbers-mode -1)
              (visual-line-mode -1)
              (hl-line-mode -1)
              (pdf-view-fit-page-to-window))))
#+end_src

*** 使用方法
- 自动处理 .pdf 文件
- =n/p= : 下一页/上一页
- =+/-= : 放大/缩小
- =W= : 自适应宽度
- =H= : 自适应高度
- =C-s= : 搜索
- =o= : 打开目录大纲



** super-save
*** 介绍
super-save 提供智能自动保存功能，在切换窗口、buffer 或空闲时自动保存文件。比 Emacs 内置的自动保存更加智能和可靠。

*** 相关链接
- GitHub: https://github.com/bbatsov/super-save

*** 配置
#+begin_src emacs-lisp
(use-package super-save
  :straight t
  :hook (after-init . super-save-mode)
  :config
  (setq super-save-auto-save-when-idle t
        super-save-silent t
        auto-save-default nil))
#+end_src

*** 使用说明
- 空闲时自动保存
- 静默模式，不显示保存消息
- 禁用默认的自动保存机制

** 终端工具

*** eat
**** 介绍
eat (Emulate A Terminal) 是一个现代化的终端模拟器，比 term.el 和 ansi-term 更快更完整。完全在 Emacs Lisp 中实现，支持完整的 ANSI 转义序列、真彩色、鼠标操作等。与 eshell 完美集成。

**** 相关链接
- Codeberg: https://codeberg.org/akib/emacs-eat

