config.el

(use-package doom-modeline
  :straight t
  :hook (after-init . doom-modeline-mode)
  :config
  (setq doom-modeline-height 25         ; 状态栏高度
        doom-modeline-bar-width 3))     ; 左侧条宽度

(use-package centaur-tabs
  :straight t
  :demand t
  :config
  ;; 基础配置
  (setq centaur-tabs-set-bar 'left
        centaur-tabs-style "bar"
        centaur-tabs-set-icons t
        centaur-tabs-gray-out-icons 'buffer
        centaur-tabs-icon-type 'nerd-icons
        centaur-tabs-set-modified-marker t)
  
  ;; 计数函数
  (defun my/count-file-buffers ()
    "计算打开的文件 buffer 数量"
    (length (cl-remove-if-not 'buffer-file-name (buffer-list))))
  
  ;; 更新显示
  (defun my/update-tabs-visibility ()
    "2个或以上文件才显示 tabs"
    (let ((count (my/count-file-buffers)))
      (if (>= count 2)
          (unless centaur-tabs-mode (centaur-tabs-mode 1))
        (when centaur-tabs-mode (centaur-tabs-mode -1)))))
  
  ;; 监听 buffer 变化
  (add-hook 'buffer-list-update-hook 'my/update-tabs-visibility)
  
  ;; 初始检查
  (run-with-idle-timer 0.5 nil 'my/update-tabs-visibility))

(use-package indent-bars
  :straight t
  :custom
  (indent-bars-no-descend-lists t)                    ; 列表不显示额外缩进线
  (indent-bars-treesit-support t)                     ; 启用 tree-sitter 支持
  (indent-bars-treesit-ignore-blank-lines-types '("module"))
  (indent-bars-treesit-scope '((python function_definition class_definition 
                                       for_statement if_statement 
                                       with_statement while_statement)))
  :hook ((java-ts-mode python-ts-mode yaml-mode c++-ts-mode) . indent-bars-mode))

(use-package all-the-icons
  :straight t
  :if (display-graphic-p))

(use-package nerd-icons
  :straight t
  :defer t
  :if (display-graphic-p))

(use-package nerd-icons-completion
  :straight t
  :after marginalia
  :hook (after-init . nerd-icons-completion-mode)
  :hook (marginalia-mode . nerd-icons-completion-marginalia-setup))

(use-package neotree
  :straight t
  :hook (after-init . (lambda ()
                        (global-set-key [f3] 'neotree-toggle)))
  :config
  (setq neo-window-width 40)  ; 设置固定宽度为30列
  (setq neo-smart-open t)  ; 自动展开到当前文件
  (setq neo-theme (if (display-graphic-p) 'nerd-icons 'arrow))
  
  ;; 禁止换行，截断长文件名
  (setq neo-window-fixed-size nil)  ; 允许窗口宽度调整
  (add-hook 'neo-after-create-hook
            (lambda (&rest _)
              (setq truncate-lines t)  ; 截断长行，不换行
              (setq word-wrap nil))))  ; 禁用自动换行

      ;; 编辑体验优化
      (auto-save-visited-mode 1)           ; 自动保存
      (show-paren-mode 1)                  ; 高亮匹配括号
      (global-auto-revert-mode 1)          ; 自动重新加载外部修改的文件
      (delete-selection-mode 1)            ; 选中文字后输入会替换
      (recentf-mode 1)                     ; 最近文件列表

      ;; 启用相对行号
      (global-display-line-numbers-mode 1)
      (setq display-line-numbers-type 'relative)

      ;; 将 yes-or-no-p 替换为 y-or-n-p
      (defalias 'yes-or-no-p 'y-or-n-p)
      ;; 关闭备份文件
      (setq make-backup-files nil)         ; 不创建 ~ 备份文件
      (setq auto-save-default nil)         ; 不创建 # 自动保存文件

(use-package sis
  :straight t
  :init
  ;; macOS 配置
  (when (eq system-type 'darwin)
    (sis-ism-lazyman-config
     "com.apple.keylayout.ABC"
     "com.tencent.inputmethod.wetype.pinyin"
     'macOS))
  
  ;; Linux 配置
  (when (eq system-type 'gnu/linux)
    (sis-ism-lazyman-config "1" "2" 'fcitx5))
  
  ;; 启用功能
  (sis-global-cursor-color-mode t)
  (sis-global-respect-mode t)     ; 不用这个，会强制切英文
  (sis-global-context-mode t)        ; 这个会根据上下文智能切换，保持输入法
  (sis-global-inline-mode t))

(use-package savehist
  :hook (after-init . savehist-mode)
  :config
  (setq history-length 1000                     ;; 保存历史条目数
        savehist-autosave-interval 300         ;; 自动保存间隔（秒）
        savehist-additional-variables '(kill-ring search-ring regexp-search-ring)))                            ;; 启用 savehist

(use-package saveplace
  :hook (after-init . save-place-mode)
  :config
  (setq save-place-file (expand-file-name "saveplace" user-emacs-directory)))                           ;; 启用 saveplace

(use-package magit
  :config
  ;; 可选配置
  (setq magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package blamer
  :straight (:host github :repo "artawower/blamer.el")
  :custom
  (blamer-idle-time 0.3)
  (blamer-min-offset 70)
  :custom-face
  (blamer-face ((t :foreground "#7a88cf"
                    :background unspecified
                    :height 140
                    :italic t)))
  :init
  (setq blamer-commit-formatter " ● %s")
  (setq blamer-author-formatter "  ✎ %s ")
  (global-blamer-mode 0))

(use-package diff-hl
  :straight t
  :init
  (diff-hl-flydiff-mode)
  (global-diff-hl-mode))

(use-package pdf-tools
  :straight t
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :init
  (setq pdf-view-display-size 'fit-page
        pdf-view-incompatible-modes
        '(display-line-numbers-mode hl-line-mode visual-line-mode)
        ;; 禁用 pdf-view 的警告
        warning-suppress-types '((pdf-view)))
  :config
  ;; 自动安装 pdf-tools（若 pdf-info 未运行）
  (unless (pdf-info-running-p)
    (pdf-tools-install-noverify))

  ;; 进入 pdf-view-mode 时自动调整显示、关闭不兼容模式
  (add-hook 'pdf-view-mode-hook
            (lambda ()
              (display-line-numbers-mode -1)
              (visual-line-mode -1)
              (hl-line-mode -1)
              (pdf-view-fit-page-to-window))))

(use-package super-save
  :straight t
  :hook (after-init . super-save-mode)
  :config
  (setq super-save-auto-save-when-idle t
        super-save-silent t
        auto-save-default nil))

(use-package eat
