config.org
**** 配置
#+begin_src emacs-lisp
(use-package eat
  :straight (eat :type git
                 :host codeberg
                 :repo "akib/emacs-eat"
                 :files ("*.el" 
                         ("e" "e/*") 
                         "*.texi" 
                         "*.ti" 
                         ("terminfo/e" "e/*") 
                         "*.info"))
  :custom
  ;; Use a more compatible terminal type
  (eat-term-name "xterm-256color")  ; or "eterm-color"
  :config
  (server-start) ;;enable emacs open at terminal
  (add-hook 'eshell-first-time-mode-hook #'eat-eshell-mode))
#+end_src

**** 使用方法
- =M-x eat= : 打开新的终端
- =M-x eshell= : 打开 eshell (自动启用 eat)
- 支持完整的终端功能，包括 vim、htop 等程序
- 在 eshell 中提供更好的命令行体验

*** vterm
**** 介绍
vterm 是基于 libvterm 的高性能终端模拟器，比 term.el 和 ansi-term 更快更完整。需要编译 C 模块，提供接近原生终端的体验。

**** 相关链接
- GitHub: https://github.com/akermu/emacs-libvterm

**** 配置
#+begin_src emacs-lisp
(use-package vterm
  :straight t
  :config
  (setq vterm-max-scrollback 10000))
#+end_src

**** 使用方法
- =M-x vterm= : 打开 vterm 终端
- 最大滚动回溯行数设置为 10000
- 支持完整的 ANSI 转义序列和真彩色

*** transient
**** 介绍
transient 是一个用于创建临时弹出菜单的框架，类似 Magit 的菜单系统。许多现代 Emacs 包依赖它来提供交互式命令界面。

**** 相关链接
- GitHub: https://github.com/magit/transient

**** 配置
#+begin_src emacs-lisp
(use-package transient
  :straight t
  :demand t)
#+end_src

** which-key
*** 介绍
which-key 在你按下一个前缀键（如 =SPC=、=C-x= 等）后，自动显示所有可用的键绑定补全建议。帮助你发现和记忆复杂的键绑定序列，非常适合初学者和使用 leader key 的配置。

*** 相关链接
- GitHub: https://github.com/justbur/emacs-which-key

*** 配置
#+begin_src emacs-lisp
  (use-package which-key
  :straight t
  :hook (after-init . which-key-mode)
  :config
  ;; setting-tag
  (which-key-add-key-based-replacements "SPC a" "ai")
  (which-key-add-key-based-replacements "SPC b" "buffer")
  (which-key-add-key-based-replacements "SPC c" "lsp")
  (which-key-add-key-based-replacements "SPC f" "Find-file")
  (which-key-add-key-based-replacements "SPC s" "seach")
  (which-key-add-key-based-replacements "SPC g" "git")
  (which-key-add-key-based-replacements "SPC m" "mark")
  (which-key-add-key-based-replacements "SPC o" "org")
  (which-key-add-key-based-replacements "SPC q" "quit")
  (which-key-add-key-based-replacements "SPC w" "window")
  (which-key-add-key-based-replacements "SPC x" "trouble")
  ;; 快速显示（0.4 秒）
  (setq which-key-idle-delay 0.1)
  ;; 在屏幕底部显示
  (setq which-key-side-window-location 'bottom)
  ;; 显示宽度
  (setq which-key-side-window-max-width 0.5))
#+end_src


*** 使用方法
- 按下任意前缀键（如 =SPC=），稍等片刻即可看到所有可用的后续按键
- 可以继续输入缩小范围，或按 =C-h= 查看分页帮助

** evil
*** 介绍
evil 是 Emacs 的 Vim 模拟层，提供完整的 Vim 模式系统（normal、insert、visual 等）。支持 Vim 的核心命令和操作，适合 Vim 用户迁移到 Emacs。

*** 相关链接
- GitHub: https://github.com/emacs-evil/evil
- 文档: https://evil.readthedocs.io/

*** 配置
#+BEGIN_SRC emacs-lisp
  (use-package evil
    :straight t
    :demand t
    :init
    (setq evil-want-keybinding nil)  ; 避免键绑定冲突
    (setq evil-want-C-u-scroll t)    ; C-u 向上滚动
    (setq evil-undo-system 'undo-fu) ; 设置 undo 系统
    :config
    (evil-mode 1)
    ;; 允许 RET 在 org-mode 中跟随链接
    (with-eval-after-load 'evil-maps
      (define-key evil-motion-state-map (kbd "RET") nil)))
#+END_SRC

*** 使用方法
- =i= : 进入插入模式
- =ESC= : 返回 normal 模式
- =v= : 进入 visual 模式
- 支持所有标准 Vim 命令：=dd=, =yy=, =p=, =u=, =Ctrl-r= 等

  
** evil-collection

*** 介绍
evil-collection 是一个 Evil 模式的扩展包，为 Emacs 的各种内置模式和第三方包提供更好的 Vim 快捷键支持。简单说，它让你在使用 Evil 模式时，能在更多地方使用 Vim 风格的快捷键，而不仅仅是编辑器。
比如在 Dired（文件管理器）、Magit（Git 客户端）、Help 等地方，都能用 hjkl 移动，dd 删除等 Vim 快捷键。

*** 相关链接
- GitHub: https://github.com/emacs-evil/evil-collection

*** 配置
#+begin_src emacs-lisp
(use-package evil-collection
  :straight t
  :after evil
  :init
  (evil-collection-init))
#+end_src

*** 使用方法
- 自动为 100+ 个 Emacs 模式添加 Vim 风格键绑定
- 在 Dired、Magit、Help、Ibuffer 等模式中都能使用 Vim 操作


** evil-commentary
*** 介绍
evil-commentary 为 Evil 模式提供快速注释/反注释功能，类似 Vim 的 commentary.vim 插件。支持按行注释、按块注释和自动识别注释符号。

*** 相关链接
- GitHub: https://github.com/linktohack/evil-commentary

*** 配置
#+begin_src emacs-lisp
(use-package evil-commentary
  :straight t
  :after evil
  :init
  (evil-commentary-mode))
#+end_src


*** 使用方法
- =gcc= : 注释/反注释当前行
- =gc= + 动作 : 注释选定范围（如 =gcap= 注释一个段落）
- 在 Visual 模式下选中后按 =gc= : 注释选中区域

** company
*** 介绍
company (Complete Anything) 是一个模块化的自动补全框架，支持多种后端（LSP、Yasnippet、Dabbrev 等）。提供弹出菜单、快速选择和文档预览。

*** 相关链接
- GitHub: https://github.com/company-mode/company-mode
- 手册: https://company-mode.github.io/

*** 配置
#+BEGIN_SRC emacs-lisp
   (use-package company
     :straight t
     :hook (after-init . global-company-mode)
     :config
  ;; 这个配置会同时显示 yasnippet、LSP、代码词汇 的补全
   (setq company-backends
         '( (company-capf                  ; LSP/完成点
            company-dabbrev-code          ; 代码词汇
            company-files)
           (company-abbrev                ; 缩写（备用）
            company-dabbrev)))            ; 文本词汇（备用）
   
   ;; 启用以下选项以优化多点补全体验
   (setq company-idle-delay 0.2)
   (setq company-minimum-prefix-length 1)
   (setq company-show-quick-access t)
   (setq company-tooltip-align-annotations t)
   
   ;; 允许多个后端同时补全
   (setq company-backend-load-all-backends t)
   
   ;; 显示补全的最大高度
   (setq company-tooltip-limit 20)
   
   ;; 在补全菜单中显示所有后端的候选项
   (setq company-selection-wrap-around t)
   
     :bind (:map company-active-map
                 ("C-n" . company-select-next)
                 ("C-p" . company-select-previous)
                 ("M-<" . company-select-first)
                 ("M->" . company-select-last)
		 ("C-<tab>" . company-complete-common-or-cycle)
                 ;; ("<tab>" . company-complete-selection)
                 ("RET" . company-complete-selection)))

#+END_SRC

*** 使用方法
- 输入时自动触发补全
- =C-n/C-p= : 上下选择
- =TAB= 或 =RET= : 确认选择
- =M-数字= : 直接选择对应编号的项

** yasnippet
*** 介绍
yasnippet 是一个代码片段系统，支持数千个预定义片段（如 HTML 标签、函数模板）。允许自定义片段，支持占位符和动态内容。

*** 相关链接
- GitHub: https://github.com/joaotavora/yasnippet
- 片段集合: https://github.com/AndreaCrotti/yasnippet-snippets

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package yasnippet
  :straight t
  :hook (prog-mode . yas-minor-mode)
  :config
  (yas-global-mode 1))
#+END_SRC

*** 使用方法
- 输入片段缩写后按 =TAB= 展开
- 例如在 Python 中输入 =def= 然后 =TAB= 展开为函数模板
- =C-c & C-n= : 创建新片段
- =C-c & C-v= : 访问片段文件

  #+begin_src emacs-lisp
(use-package yasnippet-snippets
  :straight t
  :after yasnippet)
  #+end_src


** undo-fu
*** 介绍
undo-fu 提供简单、线性的撤销/重做系统，替代 Emacs 复杂的默认 undo 机制。特别适合 Evil 模式用户，提供类似 Vim 的 undo/redo 体验。

*** 相关链接
- GitHub: https://codeberg.org/ideasman42/emacs-undo-fu
- GitLab 镜像: https://gitlab.com/ideasman42/emacs-undo-fu

*** 配置
#+begin_src emacs-lisp
  (use-package undo-fu
    :straight t
    :demand t
    :config
    ;; 确保 evil 能找到 undo-fu 的函数
    (global-unset-key (kbd "C-z"))

    ;; 使用内置的 undo 持久化（需要 Emacs 28+）
    (setq undo-no-redo t)
    ;; 增大 undo 限制
    (setq undo-limit 67108864) ; 64mb
    (setq undo-strong-limit 100663296) ; 96mb
    (setq undo-outer-limit 1006632960)) ; 960mb
#+end_src

*** 使用方法
- 在 Evil 模式下：=u= 撤销，=C-r= 重做
- 提供线性的撤销历史，避免 Emacs 默认的树状结构带来的困惑



** undo-fu-session
*** 介绍
undo-fu-session 提供简单可靠的 undo 历史持久化功能。与 undohist 不同，它更加轻量级且稳定，能够在文件关闭后保存 undo 历史，重新打开时自动恢复。

*** 相关链接
- GitHub: https://github.com/emacsmirror/undo-fu-session

*** 配置
#+begin_src emacs-lisp
(use-package undo-fu-session
  :straight t
  :after undo-fu
  :hook (after-init . global-undo-fu-session-mode)
  :config
  ;; 设置会话保存目录
  (setq undo-fu-session-directory 
        (expand-file-name "undo-fu-session/" user-emacs-directory))
  
  ;; 忽略某些文件的撤销历史
  (setq undo-fu-session-incompatible-files
        '("/tmp/" "/dev/shm/" "COMMIT_EDITMSG" ".gpg$"))
  
  ;; 显示 undo-fu-session 的日志信息
  (setq undo-fu-session-linear nil))
#+end_src

*** 使用方法
- 自动保存和恢复撤销历史，无需手动操作
- 撤销历史保存在 `~/.emacs.d/undo-fu-session/` 目录
- 与 undo-fu 完全兼容




** vundo
*** 介绍
vundo 提供可视化的撤销树浏览器，让你能看到完整的编辑历史分支。可以在撤销树中自由导航，恢复任意历史状态，非常适合需要探索不同编辑路径的场景。

*** 相关链接
- GitHub: https://github.com/casouri/vundo

*** 配置
#+begin_src emacs-lisp
(use-package vundo
  :straight t
  :commands (vundo)
  :config
  (setq vundo-compact-display t))
#+end_src

*** 使用方法
- =M-x vundo= : 打开可视化撤销树
- 在 vundo 界面中：=n/p= 前后导航，=q= 退出，=RET= 应用选中的状态



** smartparens
*** 介绍
smartparens 提供智能的括号配对、自动补全和导航功能。自动插入、删除成对的括号、引号等符号，支持跳过和包裹选区，大幅提升编码效率。

** 相关链接
- GitHub: https://github.com/Fuco1/smartparens

*** 配置
#+begin_src emacs-lisp
(use-package smartparens
  :straight t
  :hook (after-init . smartparens-global-mode)  ; 全局启用
  :config
  (require 'smartparens-config)
  (setq sp-autoskip-closing-pair 'always))
#+end_src



*** 使用方法
- 输入左括号自动补全右括号
- 删除左括号时自动删除配对的右括号
- 光标位于右括号前时自动跳过



** evil-surround
*** 介绍
evil-surround 是 Vim surround.vim 的 Emacs 移植，用于快速添加、修改、删除成对符号（括号、引号、标签等）。极大简化了处理文本周围字符的操作。

*** 相关链接
- GitHub: https://github.com/emacs-evil/evil-surround

*** 配置
#+begin_src emacs-lisp
(use-package evil-surround
  :straight t
  :after evil
  :config
  ;; 启用全局 evil-surround 模式
  (global-evil-surround-mode 1))
#+end_src

*** 使用方法
- =ys<motion><char>= : 添加周围符号（如 =ysiw"= 给单词加双引号）
- =cs<old><new>= : 修改周围符号（如 =cs"'= 将双引号改为单引号）
- =ds<char>= : 删除周围符号（如 =ds"= 删除双引号）
- 在 Visual 模式下 =S<char>= : 给选中文本添加周围符号


** expand-region
*** 介绍
expand-region 提供智能的区域扩展功能，根据语法结构逐步扩大选区范围。从光标位置开始，依次选择单词、句子、段落、函数等，非常适合快速选择代码块。

*** 相关链接
- GitHub: https://github.com/magnars/expand-region.el

*** 配置
#+begin_src emacs-lisp
  (use-package expand-region
  :straight t
  :bind ("C-=" . er/expand-region))
#+end_src

*** 使用方法
- =C-== : 扩大选区（连续按多次逐步扩大）
- =C-- C-== : 缩小选区





** evil-fringe-mark
*** 介绍
evil-fringe-mark 在编辑器边缘（fringe）显示 Evil 的标记（marks），让标记位置一目了然。支持显示普通标记和特殊标记，方便在大文件中快速定位。

*** 相关链接
- GitHub: https://github.com/Andrew-William-Smith/evil-fringe-mark

*** 配置
#+begin_src emacs-lisp
  (use-package evil-fringe-mark
    :after evil
    :config
    ;; 方案 1：evil 标记在右 fringe，bookmark 在左 fringe
;; 增加左 fringe 宽度，给 bookmark 图标更多空间
(setq-default left-fringe-width 40)
    (setq-default evil-fringe-mark-side 'right-fringe)

    ;; 可选：调整 evil 标记的样式
    (setq-default evil-fringe-mark-show-special t)  ;; 显示特殊标记
    (global-evil-fringe-mark-mode))
#+end_src

*** 使用方法
- =m<letter>= : 设置标记（如 =ma= 设置标记 a）
- ='<letter>= : 跳转到标记（如 ='a= 跳转到标记 a）
- 标记会在 fringe 显示为可视化指示符






* 导航与搜索

增强文件和内容的查找、导航能力。

** vertico
*** 介绍
vertico 是一个极简、高性能的垂直补全 UI，基于 Emacs 内置补全系统。支持循环导航、历史排序，与 orderless、marginalia 完美集成。

*** 相关链接
- GitHub: https://github.com/minad/vertico

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package vertico
  :straight t
  :hook (after-init . vertico-mode)
  :custom
  (vertico-scroll-margin 0)  ; 滚动边距
  (vertico-count 20)         ; 显示 20 个候选项
  (vertico-resize t)         ; 自动调整大小
  (vertico-cycle t))         ; 循环导航
#+END_SRC

