config.el
  :straight (eat :type git
                 :host codeberg
                 :repo "akib/emacs-eat"
                 :files ("*.el" 
                         ("e" "e/*") 
                         "*.texi" 
                         "*.ti" 
                         ("terminfo/e" "e/*") 
                         "*.info"))
  :custom
  ;; Use a more compatible terminal type
  (eat-term-name "xterm-256color")  ; or "eterm-color"
  :config
  (server-start) ;;enable emacs open at terminal
  (add-hook 'eshell-first-time-mode-hook #'eat-eshell-mode))

(use-package vterm
  :straight t
  :config
  (setq vterm-max-scrollback 10000))

(use-package transient
  :straight t
  :demand t)

  (use-package which-key
  :straight t
  :hook (after-init . which-key-mode)
  :config
  ;; setting-tag
  (which-key-add-key-based-replacements "SPC a" "ai")
  (which-key-add-key-based-replacements "SPC b" "buffer")
  (which-key-add-key-based-replacements "SPC c" "lsp")
  (which-key-add-key-based-replacements "SPC f" "Find-file")
  (which-key-add-key-based-replacements "SPC s" "seach")
  (which-key-add-key-based-replacements "SPC g" "git")
  (which-key-add-key-based-replacements "SPC m" "mark")
  (which-key-add-key-based-replacements "SPC o" "org")
  (which-key-add-key-based-replacements "SPC q" "quit")
  (which-key-add-key-based-replacements "SPC w" "window")
  (which-key-add-key-based-replacements "SPC x" "trouble")
  ;; 快速显示（0.4 秒）
  (setq which-key-idle-delay 0.1)
  ;; 在屏幕底部显示
  (setq which-key-side-window-location 'bottom)
  ;; 显示宽度
  (setq which-key-side-window-max-width 0.5))

  (use-package evil
    :straight t
    :demand t
    :init
    (setq evil-want-keybinding nil)  ; 避免键绑定冲突
    (setq evil-want-C-u-scroll t)    ; C-u 向上滚动
    (setq evil-undo-system 'undo-fu) ; 设置 undo 系统
    :config
    (evil-mode 1)
    ;; 允许 RET 在 org-mode 中跟随链接
    (with-eval-after-load 'evil-maps
      (define-key evil-motion-state-map (kbd "RET") nil)))

(use-package evil-collection
  :straight t
  :after evil
  :init
  (evil-collection-init))

(use-package evil-commentary
  :straight t
  :after evil
  :init
  (evil-commentary-mode))

   (use-package company
     :straight t
     :hook (after-init . global-company-mode)
     :config
  ;; 这个配置会同时显示 yasnippet、LSP、代码词汇 的补全
   (setq company-backends
         '( (company-capf                  ; LSP/完成点
            company-dabbrev-code          ; 代码词汇
            company-files)
           (company-abbrev                ; 缩写（备用）
            company-dabbrev)))            ; 文本词汇（备用）
   
   ;; 启用以下选项以优化多点补全体验
   (setq company-idle-delay 0.2)
   (setq company-minimum-prefix-length 1)
   (setq company-show-quick-access t)
   (setq company-tooltip-align-annotations t)
   
   ;; 允许多个后端同时补全
   (setq company-backend-load-all-backends t)
   
   ;; 显示补全的最大高度
   (setq company-tooltip-limit 20)
   
   ;; 在补全菜单中显示所有后端的候选项
   (setq company-selection-wrap-around t)
   
     :bind (:map company-active-map
                 ("C-n" . company-select-next)
                 ("C-p" . company-select-previous)
                 ("M-<" . company-select-first)
                 ("M->" . company-select-last)
		 ("C-<tab>" . company-complete-common-or-cycle)
                 ;; ("<tab>" . company-complete-selection)
                 ("RET" . company-complete-selection)))

(use-package yasnippet
  :straight t
  :hook (prog-mode . yas-minor-mode)
  :config
  (yas-global-mode 1))

(use-package yasnippet-snippets
  :straight t
  :after yasnippet)

  (use-package undo-fu
    :straight t
    :demand t
    :config
    ;; 确保 evil 能找到 undo-fu 的函数
    (global-unset-key (kbd "C-z"))

    ;; 使用内置的 undo 持久化（需要 Emacs 28+）
    (setq undo-no-redo t)
    ;; 增大 undo 限制
    (setq undo-limit 67108864) ; 64mb
    (setq undo-strong-limit 100663296) ; 96mb
    (setq undo-outer-limit 1006632960)) ; 960mb

(use-package undo-fu-session
  :straight t
  :after undo-fu
  :hook (after-init . global-undo-fu-session-mode)
  :config
  ;; 设置会话保存目录
  (setq undo-fu-session-directory 
        (expand-file-name "undo-fu-session/" user-emacs-directory))
  
  ;; 忽略某些文件的撤销历史
  (setq undo-fu-session-incompatible-files
        '("/tmp/" "/dev/shm/" "COMMIT_EDITMSG" ".gpg$"))
  
  ;; 显示 undo-fu-session 的日志信息
  (setq undo-fu-session-linear nil))

(use-package vundo
  :straight t
  :commands (vundo)
  :config
  (setq vundo-compact-display t))

(use-package smartparens
  :straight t
  :hook (after-init . smartparens-global-mode)  ; 全局启用
  :config
  (require 'smartparens-config)
  (setq sp-autoskip-closing-pair 'always))

(use-package evil-surround
  :straight t
  :after evil
  :config
  ;; 启用全局 evil-surround 模式
  (global-evil-surround-mode 1))

  (use-package expand-region
  :straight t
  :bind ("C-=" . er/expand-region))

  (use-package evil-fringe-mark
    :after evil
    :config
    ;; 方案 1：evil 标记在右 fringe，bookmark 在左 fringe
;; 增加左 fringe 宽度，给 bookmark 图标更多空间
(setq-default left-fringe-width 40)
    (setq-default evil-fringe-mark-side 'right-fringe)

    ;; 可选：调整 evil 标记的样式
    (setq-default evil-fringe-mark-show-special t)  ;; 显示特殊标记
    (global-evil-fringe-mark-mode))

(use-package vertico
  :straight t
  :hook (after-init . vertico-mode)
  :custom
  (vertico-scroll-margin 0)  ; 滚动边距
  (vertico-count 20)         ; 显示 20 个候选项
  (vertico-resize t)         ; 自动调整大小
  (vertico-cycle t))         ; 循环导航

(use-package savehist
  :straight nil  ; 内置包
  :init
  (savehist-mode))
