config.org
*** 使用方法
- =M-x= : 命令补全
- =C-x C-f= : 文件查找
- =C-n/C-p= : 上下导航
- =RET= : 确认选择

** savehist
*** 介绍
保存 minibuffer 历史记录，让补全系统能按历史频率排序结果。

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package savehist
  :straight nil  ; 内置包
  :init
  (savehist-mode))
#+END_SRC

** emacs (minibuffer 配置)
*** 配置
#+BEGIN_SRC emacs-lisp
(use-package emacs
  :straight nil
  :custom
  (context-menu-mode t)                    ; 启用上下文菜单
  (enable-recursive-minibuffers t)         ; 允许递归 minibuffer
  (read-extended-command-predicate 
   #'command-completion-default-include-p) ; 只显示可用命令
  (minibuffer-prompt-properties
   '(read-only t cursor-intangible t face minibuffer-prompt)))
#+END_SRC

** orderless
*** 介绍
orderless 提供无序、灵活的补全风格，支持空格分隔的多词匹配。例如搜索 "buf list" 可以匹配 "list-buffers"。

*** 相关链接
- GitHub: https://github.com/oantolin/orderless

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package orderless
  :straight t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles partial-completion))))
  (completion-category-defaults nil)
  (completion-pcm-leading-wildcard t))
#+END_SRC

*** 使用方法
- 在任何补全界面输入空格分隔的关键词即可模糊匹配

** marginalia
*** 介绍
在补全候选项旁添加注解，如文件大小、命令描述、变量值等，提供更丰富的上下文信息。

*** 相关链接
- GitHub: https://github.com/minad/marginalia

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package marginalia
  :straight t
  :init
  (marginalia-mode t))
#+END_SRC

  
** hl-todo
*** 介绍
hl-todo 高亮代码中的 TODO、FIXME、NOTE 等关键词，帮助你快速识别代码中的待办事项和注释标记。支持自定义关键词和颜色。

*** 相关链接
- GitHub: https://github.com/tarsius/hl-todo

*** 配置
#+begin_src emacs-lisp
(use-package hl-todo
  :straight t
  :hook (prog-mode . hl-todo-mode)
  :custom
  (hl-todo-highlight-punctuation ":"))
#+end_src

*** 使用方法
- 在代码注释中使用 =TODO:=、=FIXME:=、=NOTE:= 等关键词
- 使用键绑定 =[ t= 和 =] t= 在 TODO 之间跳转


** consult-todo
*** 介绍
consult-todo 集成 hl-todo 与 consult，提供快速搜索和导航项目中所有 TODO 标记的功能。支持预览和过滤，方便管理大型项目的待办事项。

*** 相关链接
- GitHub: https://github.com/liuyinz/consult-todo

*** 配置
#+begin_src emacs-lisp
  (use-package consult-todo
  :straight t
  :commands (consult-todo consult-todo-project))
#+end_src

*** 使用方法
- =SPC s t= : 搜索当前缓冲区的 TODO
- =SPC s T= : 搜索整个项目的 TODO


** embark
*** 介绍
embark 提供上下文动作菜单，对选中的文本、文件或符号执行各种操作。类似右键菜单，但更强大。

*** 相关链接
- GitHub: https://github.com/oantolin/embark

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package embark
  :straight t
  :bind
  (("C-;" . embark-act)
   ;; ("C-;" . embark-dwim)
   ("C-h B" . embark-bindings))
  :config
  (setq prefix-help-command 'embark-prefix-help-command))
#+END_SRC



*** 使用方法
- =C-.= : 在光标处显示动作菜单
- 选择文件后按 =C-.= 可以复制、删除、重命名等

** wgrep
*** 介绍
wgrep 允许你直接在 grep/rgrep/ag 的搜索结果中编辑文本，编辑会同步到源文件。配合 consult-ripgrep 等搜索工具使用非常强大。

*** 相关链接
- GitHub: https://github.com/mhayashi1120/Emacs-wgrep

*** 配置
#+begin_src emacs-lisp
(use-package wgrep
  :straight t
  :config
  (setq wgrep-change-readonly-file t)
  (setq wgrep-enable-key "e"))
(add-hook 'grep-mode-hook 'wgrep-setup)
#+end_src

*** 使用方法
- 在搜索结果 buffer 中按 =e= 进入编辑模式
- 直接修改搜索结果
- =C-c C-c= : 应用修改到所有文件
- =C-c C-k= : 取消修改



** embark-consult
*** 介绍
embark 与 consult 的集成包，提供更好的协同体验。

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package embark-consult
  :straight t
  :after (embark consult)
  :hook (embark-collect-mode . consult-preview-at-point-mode))
#+END_SRC


** windmove
*** 介绍
使用方向键或快捷键在窗口间快速切换焦点。

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package windmove
  :straight nil)  ; 内置包
#+END_SRC

*** 使用方法
- =C-h/j/k/l= : Vim 风格的窗口切换（需配置键绑定）



** projectile
*** 介绍
projectile 是强大的项目管理工具，自动识别和管理 Git、Maven、NPM 等项目。提供项目内文件搜索、编译、测试等功能，支持项目间快速切换。

*** 相关链接
- GitHub: https://github.com/bbatsov/projectile
- 文档: https://docs.projectile.mx/

*** 配置
#+begin_src emacs-lisp :tangle yes
  (use-package projectile
    :straight t
    :hook (after-init . projectile-mode)
    :config
    (setq projectile-completion-system 'default))
#+end_src

*** 使用方法
- =SPC f p= : 在项目中查找文件
- =SPC f P= : 切换项目
- =SPC f d= : 在项目中查找目录
- 自动识别项目根目录（包含 .git、package.json 等）



** avy
*** 介绍
avy 提供基于字符的快速跳转功能，类似 Vim 的 EasyMotion。输入一个或多个字符后，avy 会在所有匹配位置显示提示标记，输入标记即可跳转。

*** 相关链接
- GitHub: https://github.com/abo-abo/avy

*** 配置
#+begin_src emacs-lisp
(use-package avy
  :straight t
  :commands (avy-goto-char avy-goto-char-2 avy-goto-word-1 avy-goto-line)
  :config
  (setq avy-style 'at-full)
  (setq avy-all-windows t))
#+end_src

*** 使用方法
- =s= : 跳转到字符（avy-goto-char）
- =S= : 跳转到单词（avy-goto-word-1）
- 输入字符后，再输入高亮的标记字母即可跳转


* 键位绑定

自定义的键位绑定配置，主要基于 Evil 模式。
