config.el

(use-package emacs
  :straight nil
  :custom
  (context-menu-mode t)                    ; 启用上下文菜单
  (enable-recursive-minibuffers t)         ; 允许递归 minibuffer
  (read-extended-command-predicate 
   #'command-completion-default-include-p) ; 只显示可用命令
  (minibuffer-prompt-properties
   '(read-only t cursor-intangible t face minibuffer-prompt)))

(use-package orderless
  :straight t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles partial-completion))))
  (completion-category-defaults nil)
  (completion-pcm-leading-wildcard t))

(use-package marginalia
  :straight t
  :init
  (marginalia-mode t))

(use-package hl-todo
  :straight t
  :hook (prog-mode . hl-todo-mode)
  :custom
  (hl-todo-highlight-punctuation ":"))

  (use-package consult-todo
  :straight t
  :commands (consult-todo consult-todo-project))

(use-package embark
  :straight t
  :bind
  (("C-;" . embark-act)
   ;; ("C-;" . embark-dwim)
   ("C-h B" . embark-bindings))
  :config
  (setq prefix-help-command 'embark-prefix-help-command))

(use-package wgrep
  :straight t
  :config
  (setq wgrep-change-readonly-file t)
  (setq wgrep-enable-key "e"))
(add-hook 'grep-mode-hook 'wgrep-setup)

(use-package embark-consult
  :straight t
  :after (embark consult)
  :hook (embark-collect-mode . consult-preview-at-point-mode))

(use-package windmove
  :straight nil)  ; 内置包

  (use-package projectile
    :straight t
    :hook (after-init . projectile-mode)
    :config
    (setq projectile-completion-system 'default))

(use-package avy
  :straight t
  :commands (avy-goto-char avy-goto-char-2 avy-goto-word-1 avy-goto-line)
  :config
  (setq avy-style 'at-full)
  (setq avy-all-windows t))

(with-eval-after-load 'pdf-view
