config.el
  (define-key pdf-view-mode-map (kbd "C-c C-t") #'pdf-toggle-colors))

  ;; Normal 模式键位
  (evil-define-key 'normal 'global


    
    ;;org
    (kbd "SPC o p") 'org-latex-preview
    
    ;;terminal
    (kbd "C-/") 'toggle-eat

    ;;git
    (kbd "SPC g g") 'magit
    (kbd "SPC g d") 'magit-diff
    (kbd "SPC g i") 'magit-info
    (kbd "SPC g l") 'magit-log
    (kbd "B") 'blamer-show-commit-info

    ;;ai
    (kbd "SPC c e") 'toggle-copilot-mode
    (kbd "SPC a d") 'gptel-add
    (kbd "SPC a a") 'gptel
    (kbd "SPC a m") 'gptel-menu
    (kbd "SPC a t") 'gptel-tools
    (kbd "SPC g c") 'gptel-commit
    (kbd "SPC c a") 'claude-code-ide
    (kbd "SPC c t") 'claude-code-ide-stop
    (kbd "SPC c r") 'claude-code-ide-resume
    (kbd "SPC c c") 'claude-code-continue
   

    ;; 文件操作
    (kbd "SPC f f") 'find-file
    (kbd "SPC f g") 'consult-fd
    (kbd "C-s") 'save-buffer
    
    ;;undo
    (kbd "u") 'undo-only
    (kbd "C-r") 'undo-fu-only-redo

    ;;avy
    (kbd "s") 'avy-goto-char
    (kbd "S") 'avy-goto-word-1
    
    ;; 窗口管理
    (kbd "SPC -") 'split-window-below    ; 水平分割
    (kbd "SPC |") 'split-window-right   ; 垂直分割（用 \\ 代替 |）
    (kbd "SPC w d") 'delete-window       ; 删除窗口
    (kbd "SPC w k") 'enlarge-window
    (kbd "SPC w j") 'shrink-window
    (kbd "SPC w l") 'enlarge-window-horizontally
    (kbd "SPC w h") 'shrink-window-horizontally
    (kbd "C-h") 'evil-window-left
    (kbd "C-j") 'evil-window-down
    (kbd "C-k") 'evil-window-up
    (kbd "C-l") 'evil-window-right
    
    ;; 缓冲区管理
    (kbd "SPC b d") 'evil-delete-buffer
    
    ;; 标签管理
    (kbd "SPC f t") 'centaur-tabs-switch-group
    (kbd "H") 'centaur-tabs-backward-tab
    (kbd "L") 'centaur-tabs-forward-tab
    
    ;; 文件树
    (kbd "SPC e") 'neotree-toggle
    
    ;; LSP
    (kbd "g d") 'lsp-goto-type-definition
    (kbd "g r") 'lsp-ui-peek-find-references
    (kbd "g i") 'lsp-find-implementation
    (kbd "SPC c s") 'my/toggle-lsp-ui-imenu
    (kbd "SPC c f") 'lsp-format-buffer
    (kbd "SPC c a") 'lsp-execute-code-action
    (kbd "SPC c r") 'lsp-rename
    (kbd "SPC c i") 'describe-mode
    (kbd "K") 'lsp-ui-doc-glance
    
    ;; org-download
    (kbd "SPC i p") 'org-download-clipboard
    (kbd "SPC i d") 'org-download-delete
    
    ;; evil-surround
    (kbd "g s d") 'evil-surround-delete
    (kbd "g s r") 'evil-surround-change
    
    ;; 脚本
    (kbd "SPC c p") 'copy-file-path
    
    ;; bookmark
    (kbd "SPC m s") 'bookmark-set
    (kbd "SPC m j") 'bookmark-jump
    (kbd "SPC m d") 'bookmark-delete
    
    ;; 搜索和导航
    (kbd "SPC s f") 'describe-function

    ;;diagnostics
    (kbd "SPC x x") 'lsp-treemacs-errors-list
    (kbd "[ d") 'flymake-goto-prev-error
    (kbd "] d") 'flymake-goto-next-error
    (kbd "[ t") 'hl-todo-previous
    (kbd "] t") 'hl-todo-next

    ;;quit/session

    (kbd "SPC q q") 'save-buffers-kill-terminal
    (kbd "SPC q Q") 'save-buffers-kill-emacs

    (kbd "SPC f d") 'project-find-dir
    (kbd "SPC f p") 'project-find-file
    (kbd "SPC f P") 'project-switch-project
    (kbd "SPC f r") 'consult-recent-file


    (kbd "SPC s e") 'consult-flymake
    (kbd "SPC s y") 'consult-yank-pop
    (kbd "SPC s k") 'embark-bindings
    (kbd "SPC s t") 'hl-todo-occur
    (kbd "SPC s T") 'hl-todo-rgrep
    (kbd "SPC s b") 'consult-line
    (kbd "SPC SPC") 'consult-buffer
    (kbd "SPC s g") 'consult-ripgrep
    (kbd "SPC s G") 'consult-git-grep
    (kbd "SPC s n") 'yas-visit-snippet-file
    (kbd "SPC s m") 'consult-bookmark
    (kbd "SPC s S") 'imenu
    (kbd "SPC s s") 'consult-imenu)

  ;; Visual 模式键位
  (evil-define-key 'visual 'global
    ;;ai
    (kbd "SPC a r") 'gptel-rewrite
    (kbd "SPC a d") 'gptel-add
    (kbd "SPC a a") 'gptel
    (kbd "SPC a m") 'gptel-menu
    (kbd "SPC a t") 'gptel-tools

    (kbd "C-l") 'evil-end-of-line
    (kbd "C-h") 'evil-beginning-of-line
    (kbd "g s a") 'evil-surround-region)  ; 添加周围符号

  (evil-define-key 'insert 'global
    (kbd "C-h") 'backward-char
    (kbd "C-l") 'forward-char  ; 向右
    (kbd "TAB") 'smart-tab)

(with-eval-after-load 'neotree
  (evil-define-key 'normal neotree-mode-map
    ;; h 折叠当前目录（如果是文件夹且已展开），否则进入上一级
    (kbd "h")
    (lambda ()
      (interactive)
      (let ((node (neo-buffer--get-filename-current-line)))
        (cond
         ;; 当前节点是目录并已展开 → 折叠
         ((and node (file-directory-p node)
               (neo-buffer--expanded-node-p node))
          (neo-buffer--set-expand node nil)
          (neo-buffer--refresh t))
         ;; 否则回到上级目录
         (t (neotree-select-up-node)))))

    ;; l 打开文件或展开目录
    (kbd "l")
    (lambda ()
      (interactive)
      (let ((node (neo-buffer--get-filename-current-line)))
        (when node
          (if (file-directory-p node)
              (progn
                (neo-buffer--set-expand node t)
                (neo-buffer--refresh t)
                (neotree-next-line))
            (neotree-enter)))))

    ;; 其他常用快捷键
    (kbd "q") 'neotree-toggle
    (kbd "a") 'neotree-create-node
    (kbd "d") 'neotree-delete-node
    (kbd "r") 'neotree-rename-node
    (kbd "y") 'neotree-copy-node
    (kbd "RET") 'neotree-enter))

(use-package org
  :straight t
  :mode ("\\.org\\'" . org-mode)
  :config
  (setq org-startup-with-inline-images t)
  (setq org-image-align 'center)
  (setq org-image-actual-width '(800))
  (setq org-directory "~/org"
        org-startup-indented t
        org-hide-emphasis-markers t)
  
  ;; org-babel 配置
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (shell . t)
     (C . t)
     (java . t)
     (js . t)
     (ruby . t)
     (perl . t)
     (css . t)
     (latex . t)
     (org . t)))
  
  (setq org-confirm-babel-evaluate nil)
  (setq org-src-fontify-natively t)
  (setq org-src-tab-acts-natively t)
  (setq org-src-preserve-indentation t)
  (setq org-highlight-latex-and-related '(latex script entities))
  
  ;; 设置 org 标题的 doom-one 配色和字体大小
  (set-face-attribute 'org-level-1 nil :foreground "#51afef" :height 1.5 :weight 'bold)
  (set-face-attribute 'org-level-2 nil :foreground "#c678dd" :height 1.4)
  (set-face-attribute 'org-level-3 nil :foreground "#98be65" :height 1.3)
  (set-face-attribute 'org-level-4 nil :foreground "#da8548" :height 1.2)
  (set-face-attribute 'org-level-5 nil :foreground "#5699af" :height 1.1)
  (set-face-attribute 'org-level-6 nil :foreground "#a9a1e1" :height 1.0))

(use-package auctex
  :straight t
  :defer t
  :config
  ;; 自动保存时重新生成文档
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  ;; 使用 PDF 模式而不是 DVI
  (setq TeX-PDF-mode t)
  ;; 启用 RefTeX 支持
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
  ;; 自动折叠环境
  (add-hook 'LaTeX-mode-hook 'TeX-fold-mode)
  ;; 自动补全数学符号
  (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
  (setq TeX-source-correlate-start-server t))
