config.org
*** mathjax-preivew

#+begin_src emacs-lisp
(use-package math-preview
  :straight (:host gitlab :repo "matsievskiysv/math-preview")
  :config
  (when (eq system-type 'gnu/linux)
    (setq math-preview-command 
          (expand-file-name "~/.npm-global/bin/math-preview")))
  
  (setq math-preview-svg-postprocess-functions '())
  
  ;; 块级公式居中对齐
  (advice-add 'math-preview--process-input :after
    (lambda (&rest _)
      (dolist (ov (overlays-in (point-min) (point-max)))
        (when (eq (overlay-get ov 'category) 'math-preview)
          (let* ((begin (overlay-start ov))
                 (end (overlay-end ov))
                 (text (buffer-substring-no-properties begin end))
                 (is-display (or (string-match-p "^\\\\\\[" text)
                                (string-match-p "^\\$\\$" text)))
                 (display (overlay-get ov 'display)))
            (when (and is-display display)
              (let* ((image-spec (if (and (listp display) (listp (cdr display)))
                                    (cadr display)
                                  display))
                     (img-size (condition-case nil
                                  (image-size image-spec t)
                                (error nil)))
                     (img-width (if img-size (car img-size) 400))
                     (window-width (window-body-width nil t))
                     (indent (max 0 (/ (- window-width img-width) 2))))
                (overlay-put ov 'before-string 
                            (propertize " " 'display `(space :width (,indent)))))))))))
  
  ;; 窗口大小变化时自动重新居中
  (defvar-local math-preview--last-width nil)
  
  (defun math-preview--auto-recenter (frame)
    (dolist (window (window-list frame))
      (with-current-buffer (window-buffer window)
        (when (cl-some (lambda (ov) (eq (overlay-get ov 'category) 'math-preview))
                       (overlays-in (point-min) (point-max)))
          (let ((width (window-body-width window t)))
            (unless (equal width math-preview--last-width)
              (setq math-preview--last-width width)
              (with-selected-window window
                (math-preview-clear-all)
                (math-preview-all))))))))
  
  (add-to-list 'window-size-change-functions #'math-preview--auto-recenter)
  
  (math-preview-start-process))

     (defvar my/last-math-state nil
       "记录上一次光标是否在数学环境中")

     (defun my/auto-toggle-math-preview ()
       "光标进入数学环境时清除预览，离开时重新预览所有公式"
       (when (and (eq major-mode 'org-mode)
                  (not (string-equal (file-name-nondirectory (or buffer-file-name "")) "config.org")))
         (let ((in-math (texmathp)))  ; 检查是否在数学环境中
           ;; 只在状态变化时执行操作
           (unless (eq in-math my/last-math-state)
             (if in-math
                 ;; 进入数学环境：清除光标处的预览
                 (math-preview-clear-at-point)
               ;; 离开数学环境：预览所有公式
               (math-preview-all))
             ;; 更新状态
             (setq my/last-math-state in-math)))))

     ;; 将函数添加到 post-command-hook
     (add-hook 'org-mode-hook
               (lambda ()
                 (add-hook 'post-command-hook #'my/auto-toggle-math-preview nil t)))
#+end_src


*** org-latex-preview

#+begin_src emacs-lisp
;; 这些配置需要在 org 完全加载后才能执行
(with-eval-after-load 'org
(setenv "PATH" (concat "/opt/homebrew/bin:" (getenv "PATH")))
(setq exec-path (cons "/opt/homebrew/bin" exec-path))

  ;; Retina 优化 + 自动居中
  (plist-put org-format-latex-options :scale 2.0)
  
  (setq org-preview-latex-default-process 'imagemagick)
  (setq org-preview-latex-process-alist
        '((imagemagick
           :programs ("xelatex" "magick")
           :description "pdf > png"
           :message "需要安装 xelatex 和 imagemagick"
           :image-input-type "pdf"
           :image-output-type "png"
           :image-size-adjust (1.0 . 1.0)
           :latex-compiler ("xelatex -interaction nonstopmode -output-directory %o %f")
           :image-converter ("convert -density 300 -trim %f -quality 100 %O"))))

;; 使用 dvipng 渲染 LaTeX 公式
;; (setq org-preview-latex-default-process 'dvipng)

;; (setq org-preview-latex-process-alist
;;       '((dvipng
;;          :programs ("latex" "dvipng")                  ;; 调用 latex 和 dvipng
;;          :description "DVI > PNG"
;;          :message "需要安装 latex 和 dvipng"
;;          :use-xcolor t                                  ;; 支持公式颜色
;;          :image-input-type "dvi"                        ;; 输入类型为 DVI
;;          :image-output-type "png"                       ;; 输出 PNG
;;          :image-size-adjust (1.0 . 1.0)                 ;; 图片缩放
;;          :latex-compiler ("latex -interaction=nonstopmode -output-directory=%o %f")
;;          :image-converter ("dvipng -D 300 -T tight -o %O %f")))) ;; DVI 转 PNG

;; (setq org-preview-latex-default-process 'dvisvgm)


  ;; 行内图片缩放
  (advice-add 'org--create-inline-image :filter-return
              (lambda (img) (image--set-property img :scale 0.5) img))
  
  ;; LaTeX 预览缩放 + 居中
  (defun my/org-latex-preview-setup (beg end image &optional imagetype)
    "设置 LaTeX 预览:Retina 缩放 + 独立公式居中"
    (let ((ov (car (overlays-at beg))))
      (when (eq (overlay-get ov 'org-overlay-type) 'org-latex-overlay)
        ;; 设置缩放
        (overlay-put ov 'display
                     `(image :type ,(or (and imagetype (intern imagetype)) 'png)
                            :file ,image :ascent center :scale 0.5))
        ;; 独立成行则居中
        (when (save-excursion
                (goto-char beg)
                (and (looking-back "^[[:space:]]*" (line-beginning-position))
                     (goto-char end)
                     (looking-at "[[:space:]]*$")))
          (overlay-put ov 'line-prefix 
                       `(space :align-to (- center (0.5 . ,(overlay-get ov 'display)))))))))
  
  (advice-add 'org--make-preview-overlay :after #'my/org-latex-preview-setup))
#+end_src

*** 使用方法
- =C-c C-c= : 执行代码块
- =C-c '= : 编辑代码块
- =TAB= : 折叠/展开标题
- =C-c C-e= : 导出菜单

** org-superstar
*** 介绍
美化 org-mode 的标题和列表项，使用更好看的符号替代星号。

*** 相关链接
- GitHub: https://github.com/integral-dw/org-superstar-mode

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package org-superstar
  :straight t
  :after org
  :hook (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-headline-bullets-list
        '("◉" "○" "✸" "✿" "✦" "❀" "➤" "▶"))
  
  (setq org-superstar-item-bullet-alist
        '((?* . ?•) (?+ . ?➤) (?- . ?•)))
  
  (setq org-superstar-checkbox-bullet-alist
        '((?X . "☒") (?? . "☐") (?\  . "☐")))
  
  (setq org-superstar-item-indent-offset 2)
  (setq org-superstar-remove-leading-stars t)
  (setq org-superstar-use-with-org-bullets t))
#+END_SRC




** org-bars
*** 介绍
org-bars 为 org-mode 标题添加漂亮的垂直彩色条，增强视觉层次感。支持自定义颜色和样式，让 org 文档更加美观易读。

*** 相关链接
- GitHub: https://github.com/tonyaldon/org-bars

*** 配置
#+begin_src emacs-lisp
(use-package org-bars
  :straight (org-bars :type git :host github :repo "tonyaldon/org-bars")
  :after org
  :hook (org-mode . org-bars-mode)
  :config
  ;; 星号符号配置
  (setq org-bars-stars '(:empty "◉"
                         :invisible "▶"
                         :visible "▼")))
;; 方案2: 统一的次要颜色
;; (setq org-bars-color-options '(:only-one-color t
;;                                :bar-color "#51afef")))  ;;
  ;; 方法 1: 让 bars 跟随标题颜色（推荐）
  ;; 默认就是这样，bars 会继承各级标题的颜色
 ;; (setq org-bars-color-options nil))
#+end_src

*** 使用方法
- 在 org-mode 中自动显示，无需手动操作
- 折叠/展开标题时彩色条会自动调整


** auctex
*** 介绍
AUCTeX 是 Emacs 中最强大的 LaTeX 编辑环境，提供语法高亮、自动补全、PDF 同步预览等功能。

*** 相关链接
- 官网: https://www.gnu.org/software/auctex/
- GitHub: https://github.com/emacs-auctex/auctex

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package auctex
  :straight t
  :mode (("\\.tex\\'" . LaTeX-mode)
         ("\\.ltx\\'" . LaTeX-mode)
         ("\\.cls\\'" . LaTeX-mode))
  :init
  (setq TeX-auto-save t
        TeX-parse-self t
        TeX-master nil)
  :config
  (require 'texmathp)
  (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
  (add-hook 'LaTeX-mode-hook 'turn-on-reftex))
#+END_SRC

*** 使用方法
- =C-c C-c= : 编译文档
- =C-c C-v= : 查看 PDF
- =C-c C-e= : 插入环境
- =C-c C-m= : 插入宏

** org-latex 导出配置
