config.org
*** 配置
#+BEGIN_SRC emacs-lisp
(setq org-latex-compiler "xelatex")
(setq org-latex-pdf-process
      '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

;; 使用 minted
(setq org-latex-listings 'minted)

;; 语言映射
(with-eval-after-load 'ox-latex
  (add-to-list 'org-latex-minted-langs '(emacs-lisp "common-lisp"))
  (add-to-list 'org-latex-minted-langs '(elisp "common-lisp")))

;; minted 选项
(setq org-latex-minted-options
      '(("fontsize" "\\small")
        ("breaklines" "true")
        ("breakanywhere" "true")
        ("bgcolor" "boxback")
        ("frame" "leftline")
        ("framerule" "2pt")
        ("rulecolor" "boxblue")
        ("baselinestretch" "1.2")))
#+END_SRC
** org-plus-contrib
*** 介绍
org-contrib 是 Org-mode 的贡献模块集合，包含一些由社区和维护者贡献的额外功能和扩展，这些功能没有被纳入 Org-mode 的核心。
org-contrib 包含哪些功能？
一些主要的模块包括：

org-annotate-file：为文件添加注释
org-attach-git：使用 Git 管理附件
org-bookmark：书签管理
org-elisp-symbol：符号链接支持
org-eval：代码评估
org-expiry：过期日期处理
org-git-link：Git 链接支持
org-mac-link：Mac 应用链接
org-man：Man 页面支持
以及其他社区贡献的模块

org-contrib vs org-plus-contrib 的关系：

org：核心功能
org-contrib：额外的贡献模块（独立包）
org-plus-contrib：org + org-contrib 的组合（现已弃用）

#+begin_src emacs-lisp
(use-package org-contrib
  :straight t
  :after org)
#+end_src

** org-download
:PROPERTIES:
:ID:       dc34808e-9e63-41d7-bbdb-995aae719b79
:END:

*** 介绍
org-download 简化在 org-mode 中插入图片的流程，支持从剪贴板、URL、本地文件等多种方式插入图片。自动管理图片文件，支持截图和拖放。

*** 相关链接
- GitHub: https://github.com/abo-abo/org-download

*** 配置
#+begin_src emacs-lisp
(use-package org-download
  :straight t
  :after org
  :hook (org-mode . org-download-enable)
  :config
  (setq org-download-image-dir "./images")
  (setq org-download-heading-lvl nil)
  (setq org-download-timestamp "%Y%m%d-%H%M%S_")
  (setq org-download-screenshot-method "screencapture -i %s")
  (setq org-download-display-inline-images t)
  (setq org-download-image-attr-list '("#+ATTR_ORG: :width 600")))

#+end_src

*** 使用方法
- =SPC i p= : 从剪贴板插入图片
- =SPC i d= : 删除光标处的图片
- 图片自动保存在当前文件的 `./images/` 目录




** procress
*** 介绍
procress 为 AUCTeX 提供编译进度的可视化显示，在 LaTeX 编译过程中显示进度条和状态图标，让你实时了解编译进度。

*** 相关链接
- GitHub: https://github.com/haji-ali/procress

*** 配置
#+begin_src emacs-lisp
(use-package procress
  :straight (:host github :repo "haji-ali/procress")
  :commands procress-auctex-mode
  :init
  (add-hook 'LaTeX-mode-hook #'procress-auctex-mode)
  :config
  (procress-load-default-svg-images))
#+end_src

*** 使用方法
- LaTeX 编译时自动显示进度
- 在 mode-line 显示编译状态图标

** helpful
*** 介绍
helpful 提供更友好、更详细的帮助文档界面。相比内置的 describe-* 命令，helpful 显示更多有用信息，如源代码、引用位置、快捷键等。

*** 相关链接
- GitHub: https://github.com/Wilfred/helpful

*** 配置
#+begin_src emacs-lisp
(use-package helpful
  :defer 3
  :bind
  (([remap describe-function] . #'helpful-callable)
   ([remap describe-variable] . #'helpful-variable)
   ([remap describe-key] . #'helpful-key)
   ([remap describe-command] . #'helpful-command)
   ([remap describe-symbol] . #'helpful-symbol)
   ("C-h C-d" . #'helpful-at-point)
   ("C-h F" . #'helpful-function))
  :config
  (add-hook 'helpful-mode-hook 'visual-line-mode))
#+end_src

*** 使用方法
- 替代所有原生的 describe-* 命令
- =C-h f= : 查看函数帮助
- =C-h v= : 查看变量帮助
- =C-h k= : 查看按键绑定
- =C-h C-d= : 查看光标处符号的帮助


** laas (LaTeX Auto-Activating Snippets)
*** 介绍
laas 为 LaTeX 和 Org 模式提供自动激活的代码片段系统，无需按 TAB 展开。输入特定字符序列后自动替换，极大提升数学公式和 LaTeX 输入效率。

*** 相关链接
- GitHub: https://github.com/tecosaur/LaTeX-auto-activating-snippets

*** 配置
#+begin_src emacs-lisp
(use-package laas
  :straight t
  :hook ((LaTeX-mode . laas-mode) (org-mode . laas-mode))
  :config
  (aas-set-snippets 'laas-mode
                    ;; set condition!
                    :cond #'texmathp ; expand only while in math
		    "qq" "\\quad"
		    "c.." "\cdots"
		    "le" "\\leq"
                    "On" "O(n)"
		    "ra" " \\Rightarrow "
		    "oo"  "\\infty"
		    "int" "\\int"
		    "-oo"  "-\\infty"
                    "O1" "O(1)"
                    "Olog" "O(\\log n)"
		    ";" "\&"
		    "\\" "\\\\"
                    "Olon" "O(n \\log n)"
                    ;; bind to functions!
                    "sum" (lambda () (interactive)
                            (yas-expand-snippet "\\sum\\limits_{$1}^{$2} $3"))

                    "bmat" (lambda () (interactive)
                            (yas-expand-snippet "\\begin{bmatrix} $1 \\end{bmatrix} $2"))

                    "l(" (lambda () (interactive)
                            (yas-expand-snippet "\\left( $1 \\right"))

                    "xsp" (lambda () (interactive)
                            (yas-expand-snippet "$1^{$2} + $1^{2*$2} + \\dots + $1^{n*$2}"))

                    "xas" (lambda () (interactive)
                            (yas-expand-snippet "$1_{1}$2_{1} + $1_{2}$2_{2} + \\dots + $1_{$3}$2_{$3}"))
                    "ff" (lambda () (interactive)
                            (yas-expand-snippet "\\frac{$1}{$2} $0"))

                    "prod" (lambda () (interactive)
                            (yas-expand-snippet "\\prod\\limits_{${1:i}^{${2:n}}${0:x}"))))

(defun my/simple-absorb (pattern replacement)
  "通用的正则吸取函数，支持 YAS 跳转
PATTERN: 正则表达式模式
REPLACEMENT: 替换字符串，用 %s 表示匹配内容，支持 $1, $2, $0 跳转点"
  (cond
   ;; 1. 尝试正则模式匹配吸取
   ((looking-back pattern (line-beginning-position))
    (let ((matched (match-string 1)))
      (replace-match "")
      (yas-expand-snippet (format replacement matched))))
   ;; 2. 尝试 LAAS 对象包装（如果存在的话）
   ((and (fboundp 'laas-object-on-left-condition)
         (laas-object-on-left-condition)
         (string-match "\\\\\\([a-z]+\\)" replacement))
    (laas-wrap-previous-object (match-string 1 replacement)))
   ;; 3. 普通插入
   (t 
    (yas-expand-snippet (replace-regexp-in-string "%s" "" replacement)))))

;; 核心吸取函数
(defun my/absorb-sub ()
  "下标吸取: xsub -> x_{} 支持跳转"
  (interactive)
  (my/simple-absorb "\\([a-zA-Z]+\\)sub" "%s_{$1}$0"))


(defun my/absorb-pow ()
  "下标吸取: xpow -> x^{} 支持跳转"
  (interactive)
  (my/simple-absorb "\\([a-zA-Z]+\\)pow" "%s^{$1}$0"))


(defun my/absorb-brace ()
  "xbc -> x() 支持跳转"
  (interactive)
  (my/simple-absorb "\\([a-zA-Z]+\\)bc" "%s($0)"))

(defun my/absorb-bb ()
  "黑板体吸取: Abb -> \\mathbb{A}"
  (interactive)
  (my/simple-absorb "\\([A-Z]\\)bb" "\\mathbb{$s}"))


(defun my/absorb-bf ()
  "黑板体吸取: Abb -> \\mathbb{A}"
  (interactive)
  (my/simple-absorb "\\([A-Z]\\)bf" "\\mathbf{$s}"))

(defun my/absorb-hat ()
  "帽子吸取: xhat -> \\hat{x}"
  (interactive)
  (my/simple-absorb "\\([a-zA-Z]+\\)hat" "\\hat{$s}"))

;; 注册到 LAAS
(with-eval-after-load 'laas
  (aas-set-snippets 'laas-mode
    :cond #'texmathp
    :cond #'laas-object-on-left-condition
    "qq" (lambda () (interactive) (laas-wrap-previous-object "sqrt"))
    "sub" #'my/absorb-sub
    "bb" #'my/absorb-bb
    "bf" #'my/absorb-bf
    "pow" #'my/absorb-pow
    "hat" #'my/absorb-hat
    "bc" #'my/absorb-brace))


(with-eval-after-load 'laas
  (aas-set-snippets 'laas-mode
                    :cond (lambda () (not (texmathp)))
                    "ii" (lambda () (interactive)
                            (yas-expand-snippet "\\\\( $0 \\\\)"))
                    "dd" (lambda () (interactive)
                            (yas-expand-snippet "\\[\n $0 \n\\]"))))


#+end_src

*** 使用说明

*基础 snippets（在数学环境中）*
- =qq= : \quad
- =c..= : \cdots
- =le= : \leq
- =ra= : \Rightarrow
- =oo= : \infty
- =-oo= : -\infty
- =int= : \int
- =;;= : &
- =\\= : \\

*大O记号*
- =On= : O(n)
- =O1= : O(1)
- =Olog= : O(\log n)
- =Olon= : O(n \log n)

*模板 snippets*
- =sum= : 求和符号模板 \sum\limits_{$1}^{$2} $0
- =prod= : 连乘符号模板 \prod\limits_{$1}^{$2} $0
- =ff= : 分数模板 \frac{$1}{$2} $0
- =lc= : 括号 \left( $1 \right) $0
- =bmat= : 矩阵 \begin{bmatrix} $1 \end{bmatrix} $0
- =xsp= : 幂级数展开模板
- =xas= : 求和展开模板

*吸取 snippets（会吸取前面的字符）*
- =xsub= : 转换为下标 x_{$1}
- =xpow= : 转换为上标 x^{$1}
- =xbc= : 添加括号 x($0)
- =Abb= : 黑板体 \mathbb{A}
- =Abf= : 粗体 \mathbf{A}
- =xhat= : 帽子 \hat{x}
- =qq= : 对前面内容包裹平方根 \sqrt{x}

*非数学环境*
- =ii= : 行内公式 \( $0 \)
- =dd= : 独立公式 \[ $0 \]


* 编程开发

LSP、tree-sitter 和各种编程语言支持。

** lsp-mode
*** 介绍
lsp-mode 是 Language Server Protocol 的 Emacs 实现，提供智能补全、代码导航、重构、诊断等 IDE 级别的功能。支持几十种编程语言。

*** 相关链接
- GitHub: https://github.com/emacs-lsp/lsp-mode
- 官网: https://emacs-lsp.github.io/lsp-mode/

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package lsp-mode
  :straight t
  :hook ((c-ts-mode . lsp)
         (c++-ts-mode . lsp)
         (python-ts-mode . lsp)
         (nix-ts-mode . lsp)
         (java-ts-mode . lsp)
         (go-mode . lsp))
  :commands lsp
  :init
  ;; 配置 nix-nil 服务器
  (when (eq system-type 'darwin)
    (setq lsp-nix-nil-server-path "/Users/luoyaohui/.nix-profile/bin/nil"))
  
  (when (eq system-type 'gnu/linux)
    (setq lsp-clients-clangd-executable "/etc/profiles/per-user/manjack/bin/clangd")
    (setq lsp-nix-nil-server-path "nil")) ;; Linux 上从 PATH 找
  
  :config
  (setq lsp-prefer-flymake nil))

(add-hook 'lsp-mode-hook
          (lambda ()
            (add-hook 'before-save-hook #'lsp-format-buffer nil t)))
#+END_SRC


*** 使用方法
- =g d= : 跳转到定义
- =g r= : 查找引用
- =SPC c f= : 格式化代码
- =M-x lsp-rename= : 重命名符号
- =M-x lsp-organize-imports= : 整理导入

*** 支持的语言
需要先安装对应的 language server：
- Python: =pip install python-lsp-server=
- C/C++: =clangd=
- Java: 自动下载（通过 lsp-java）
- Go: =go install golang.org/x/tools/gopls@latest=
- Rust: =rustup component add rust-analyzer=

** lsp-ui
*** 介绍
lsp-ui 为 lsp-mode 提供 UI 增强，包括悬浮文档、侧边信息、代码预览等。

*** 相关链接
- GitHub: https://github.com/emacs-lsp/lsp-ui

