config.org
*** 配置
#+BEGIN_SRC emacs-lisp
  (use-package lsp-ui
    :straight t
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-sideline-enable t)
    (lsp-ui-doc-position 'at-point)      ; 在光标位置显示
    (lsp-ui-sideline-show-code-actions t)
    (lsp-ui-sideline-show-diagnostics t)
    (lsp-ui-sideline-ignore-duplicate t)
    (lsp-diagnostics-provider :flymake)  ; 确保用 flymake
    (lsp-ui-peek-enable t)
    (lsp-ui-peek-always-show t)
    (lsp-ui-peek-show-directory t))
#+END_SRC

*** 使用方法
- 光标悬停显示文档
- 侧边栏显示类型和诊断信息
- =g r= : 使用 peek 预览引用





** sideline
*** 介绍
sideline 在代码行的右侧显示额外信息，如错误、警告、文档等。提供可扩展的后端系统，支持多种信息源同时显示。

*** 相关链接
- GitHub: https://github.com/emacs-sideline/sideline

*** 配置
#+begin_src emacs-lisp
  (use-package sideline
  :straight t
  :hook (flymake-mode . sideline-mode)
  :custom
  (sideline-backends-right '(sideline-flymake)))
#+end_src

*** 使用方法
- 自动在代码行右侧显示 flymake 诊断信息
- 光标移动到有问题的行时显示详细错误信息



** sideline-flymake
*** 介绍
sideline-flymake 是 sideline 的 flymake 后端，将 flymake 的诊断信息显示在代码行右侧。比默认的悬浮提示更加直观。

*** 相关链接
- GitHub: https://github.com/emacs-sideline/sideline-flymake

*** 配置
#+begin_src emacs-lisp
  (use-package sideline-flymake
  :straight t
  :after sideline flymake)
#+end_src

*** 使用方法
- 与 sideline 配合使用，自动显示诊断信息
- 支持显示错误、警告和提示级别的信息



** flymake
#+begin_src emacs-lisp
  (use-package flymake
  :straight nil
  :hook (prog-mode . flymake-mode))
#+end_src

** lsp-nix
#+begin_src emacs-lisp
(use-package nix-ts-mode
  :straight t
  :mode "\\.nix\\'"
  :hook (nix-ts-mode . lsp))
#+end_src


** lsp-pyright
*** 介绍
lsp-pyright 为 Python 提供基于 Pyright 的 LSP 支持。Pyright 是微软开发的高性能 Python 类型检查器，提供快速、准确的代码补全和类型检查。

*** 相关链接
- GitHub: https://github.com/emacs-lsp/lsp-pyright
- Pyright 官方: https://github.com/microsoft/pyright

*** 配置
#+begin_src emacs-lisp
  (use-package lsp-pyright
  :straight t
  :custom (lsp-pyright-langserver-command "pyright") ;; or basedpyright
  :hook (python-ts-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp))))  ; or lsp-deferred
#+end_src

*** 使用方法
- 在 Python 文件中自动启动
- 需要先安装 Pyright: =npm install -g pyright=
- 提供类型检查、自动补全、重构等功能

** lsp-java
*** 介绍
为 Java 开发提供 LSP 支持，基于 Eclipse JDT Language Server，支持 Maven 和 Gradle 项目。

*** 相关链接
- GitHub: https://github.com/emacs-lsp/lsp-java

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package lsp-java
  :straight t
  :after lsp-mode
  :hook (java-ts-mode . lsp))
#+END_SRC

*** 使用方法
- 首次打开 Java 项目会自动下载 language server
- 支持 Maven/Gradle 项目导入
- 所有 LSP 功能可用

** treesit-auto
*** 介绍
treesit-auto 自动管理 tree-sitter 语法解析器，无需手动配置。tree-sitter 提供更准确的语法高亮和代码分析。

*** 相关链接
- GitHub: https://github.com/renzmann/treesit-auto
- Tree-sitter: https://tree-sitter.github.io/

*** 配置
#+BEGIN_SRC emacs-lisp
(use-package treesit-auto
  :straight t
  :hook (after-init . global-treesit-auto-mode)
  :config
  (setq treesit-auto-install 'prompt))  ; 提示安装语法
#+END_SRC

*** 使用方法
- 打开支持的文件时自动启用 tree-sitter
- 首次使用某语言时提示安装语法
- =M-x treesit-auto-install-all= : 安装所有语法

*** 支持的语言
50+ 种语言，包括：
- C, C++, Python, Java, Go, Rust, Ruby, PHP
- JavaScript, TypeScript, HTML, CSS
- Bash, JSON, YAML, Markdown
- 等等...




** 待要安装的插件
- 代码补全与 LSP: copilot-chat
- 其他: magit-todos


#+begin_src emacs-lisp
;; (use-package ai-code-interface
;;   :straight (:host github :repo "tninja/ai-code-interface.el")
;;   :after claude-code-ide
;;   :bind ("C-c a" . ai-code-menu)
;;   :config
;;   (ai-code-set-backend 'claude-code-ide)
  
;;   ;; 可选：Magit 集成
;;   (with-eval-after-load 'magit
;;     (ai-code-magit-setup-transients)))
#+end_src




#+begin_src emacs-lisp
(use-package org-sliced-images
  :straight t
  :config
  (org-sliced-images-mode 1))
#+end_src

#+begin_src emacs-lisp
(use-package beacon
  :straight t
  :config
  (beacon-mode 1))
#+end_src


#+begin_src emacs-lisp
(defun my-window-resize ()
  "窗口调整模式，连按 h/j/k/l"
  (interactive)
  (message "使用 h/j/k/l 调整窗口大小")
  (set-transient-map
   (let ((map (make-sparse-keymap)))
     (define-key map "h" (lambda () (interactive) (shrink-window-horizontally 3) (my-window-resize)))
     (define-key map "j" (lambda () (interactive) (shrink-window 3) (my-window-resize)))
     (define-key map "k" (lambda () (interactive) (enlarge-window 3) (my-window-resize)))
     (define-key map "l" (lambda () (interactive) (enlarge-window-horizontally 3) (my-window-resize)))
     map)))

(global-set-key (kbd "C-c w") 'my-window-resize)
#+end_src
* AI 辅助编程
AI 相关工具配置，包括 GPT、Copilot 等智能编程助手。
** gptel
*** 介绍
gptel 是 Emacs 的通用 LLM 客户端，支持 ChatGPT、Claude、Gemini 等多种 AI 模型。可以在 Emacs 中直接与 AI 对话、重写代码、生成提交信息等。

*** 相关链接
- GitHub: https://github.com/karthink/gptel

*** 配置
#+begin_src emacs-lisp
(use-package gptel
  :straight t
   :config
;; OPTIONAL configuration
(setq gptel-default-mode 'org-mode)
(setq gptel-model 'gpt-4o
      gptel-backend (gptel-make-gh-copilot "Copilot"))

(gptel-make-gh-copilot "Copilot"))

#+end_src

*** 使用方法
- =SPC a a= : 打开 gptel 对话
- =SPC a m= : 打开 gptel 菜单
- =SPC a r= (Visual 模式): 重写选中的文本
- =SPC a d= : 将选中内容添加到对话上下文
- =SPC a t= : gptel 工具菜单
- =SPC g c= : 生成 Git 提交信息

** mcp (Model Context Protocol)
*** 介绍
MCP 为 AI 模型提供标准化的上下文协议，让 AI 能够更好地理解项目结构和代码上下文。

*** 配置
#+begin_src emacs-lisp
(use-package mcp
  :straight t)

(require 'gptel-integrations)

(setq mcp-hub-servers
      '(("github"
         :command "github-mcp-server"
         :args ("stdio"))))
#+end_src

** gptel-commit
*** 介绍
gptel-commit 集成 gptel 和 magit，使用 AI 自动生成符合规范的 Git 提交信息。

*** 配置
#+begin_src emacs-lisp
(use-package gptel-commit
  :straight t
  :after (gptel magit)
  :custom
  (gptel-commit-stream t))
#+end_src

*** 使用方法
- 在 magit commit 界面使用 =SPC g c= 生成提交信息
- AI 会根据 diff 内容生成合适的提交描述

** copilot
*** 介绍
copilot.el 是 GitHub Copilot 的 Emacs 客户端，支持 AI 自动补全代码。它可以在编程模式下自动激活，提供智能代码建议，提升开发效率。

*** 相关链接
- GitHub: https://github.com/copilot-emacs/copilot.el

*** 配置
#+begin_src emacs-lisp
(use-package copilot
  :straight (:host github :repo "copilot-emacs/copilot.el" :files ("*.el"))
  ;; :hook (prog-mode  . copilot-mode)  ; 在编程模式和 org-mode 下自动启用
  :config
  ;; 禁用缩进警告
  (setq copilot-disable-predicates 
        '(copilot-hide-completion-on-escape
          copilot-hide-completion-on-comment
          copilot-hide-completion-on-string))
  (setq copilot-indent-offset-warning-disable t)
  ;; 显示设置
  (setq copilot-enable-predicates '(copilot-hide-completion-on-escape))
  (setq copilot-idle-delay 0.5))
#+end_src

*** 使用方法
- 在编程模式下自动启用 Copilot，无需手动启动
- 输入代码时自动显示 AI 补全建议
- 支持通过快捷键接受、拒绝或切换建议
- 可自定义显示和触发条件，适应不同编程习惯

** claude-code-ide
*** 介绍
claude-code-ide 将 Claude AI 集成到 Emacs 中，提供智能代码补全、重构和对话功能。支持通过 MCP 协议与 Claude 交互。

*** 相关链接
- GitHub: https://github.com/manzaltu/claude-code-ide.el

*** 配置
#+begin_src emacs-lisp
(use-package claude-code-ide
  :straight (:type git :host github :repo "manzaltu/claude-code-ide.el")
  :bind ("C-c C-'" . claude-code-ide-menu)
  :config
  (claude-code-ide-emacs-tools-setup))
#+end_src

*** 使用方法
- =SPC c a= : 启动 claude-code-ide
- =SPC c t= : 停止当前任务
- =SPC c r= : 恢复任务
- =SPC c c= : 继续对话
- =C-c C-'= : 打开 Claude IDE 菜单


* 附录
** 包管理常用命令速查
*** straight.el 命令
- =M-x straight-pull-all= : 更新所有包
- =M-x straight-pull-package= : 更新单个包
- =M-x straight-rebuild-all= : 重建所有包
- =M-x straight-rebuild-package= : 重建单个包
- =M-x straight-freeze-versions= : 创建版本锁定文件
- =M-x straight-thaw-versions= : 从锁定文件恢复版本
- =M-x straight-check-all= : 检查所有包状态
- =M-x straight-check-package= : 检查单个包状态
** 问题排查
*** 如果某个包加载失败
1. 检查: =M-x straight-check-package=
2. 重建: =M-x straight-rebuild-package=
3. 查看日志: 切换到 =*straight-process*= 缓冲区

*** 如果启动时出错
#+BEGIN_SRC bash
# 使用 debug 模式启动
emacs --debug-init
#+END_SRC

*** 重置配置
#+BEGIN_SRC bash
# 删除 straight 目录重新开始
rm -rf ~/.emacs.d/straight/
# 重启 Emacs
#+END_SRC

** 配置文件位置
- 主配置: =~/.emacs.d/config.org=
- 初始化: =~/.emacs.d/init.el=
- 包目录: =~/.emacs.d/straight/=
- 备份: =~/.emacs.d/config.org.backup-*=
** 开发工具集成
本配置集成了多种开发工具，提供完整的 IDE 体验:
*** Git 版本控制
- Magit: 强大的 Git 界面
- diff-hl: 实时显示文件差异
- gptel-commit: AI 生成提交信息

*** 终端工具
- eat: 现代化终端模拟器  
- vterm: 高性能终端
- eshell: Emacs shell

*** AI 辅助
- copilot: GitHub Copilot 代码补全
- gptel: 通用 LLM 客户端
- claude-code-ide: Claude AI 集成
- mcp: 模型上下文协议

** TODO 任务列表
*** DONE 设置pdftool的颜色随着时间变化成modus黄和modus黑

*** DONE which-key 设置标签
为常用命令组添加友好的标签描述

*** DONE Git 快捷键优化
整理和优化 Git 相关的键位绑定

*** DONE AI 快捷键统一
统一 AI 工具的快捷键命名规范

*** DONE 时间自动调节主题
已实现 modus-themes 根据时间自动切换

*** DONE 设置 C-/ toggle eat
已实现终端快速切换功能

*** TODO 完善类似 org-frog 的功能，让其支持更多的环境。当\[ \]中间有换行的时候不好触发

*** TODO math-preivew 的bug,当 font-height 设置大160时，预览会偏移



#+begin_src emacs-lisp
(use-package evil-matchit
  :straight t
  :config
  (global-evil-matchit-mode 1)
  )
#+end_src



#+begin_src emacs-lisp
(use-package evil-anzu
  :straight t
  :after evil
  :diminish
  :demand t
  :init
  (global-anzu-mode t))
#+end_src


