config.el

  (use-package lsp-ui
    :straight t
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-sideline-enable t)
    (lsp-ui-doc-position 'at-point)      ; 在光标位置显示
    (lsp-ui-sideline-show-code-actions t)
    (lsp-ui-sideline-show-diagnostics t)
    (lsp-ui-sideline-ignore-duplicate t)
    (lsp-diagnostics-provider :flymake)  ; 确保用 flymake
    (lsp-ui-peek-enable t)
    (lsp-ui-peek-always-show t)
    (lsp-ui-peek-show-directory t))

  (use-package sideline
  :straight t
  :hook (flymake-mode . sideline-mode)
  :custom
  (sideline-backends-right '(sideline-flymake)))

  (use-package sideline-flymake
  :straight t
  :after sideline flymake)

  (use-package flymake
  :straight nil
  :hook (prog-mode . flymake-mode))

(use-package nix-ts-mode
  :straight t
  :mode "\\.nix\\'"
  :hook (nix-ts-mode . lsp))

  (use-package lsp-pyright
  :straight t
  :custom (lsp-pyright-langserver-command "pyright") ;; or basedpyright
  :hook (python-ts-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp))))  ; or lsp-deferred

(use-package lsp-java
  :straight t
  :after lsp-mode
  :hook (java-ts-mode . lsp))

(use-package treesit-auto
  :straight t
  :hook (after-init . global-treesit-auto-mode)
  :config
  (setq treesit-auto-install 'prompt))  ; 提示安装语法

;; (use-package ai-code-interface
;;   :straight (:host github :repo "tninja/ai-code-interface.el")
;;   :after claude-code-ide
;;   :bind ("C-c a" . ai-code-menu)
;;   :config
;;   (ai-code-set-backend 'claude-code-ide)
  
;;   ;; 可选：Magit 集成
;;   (with-eval-after-load 'magit
;;     (ai-code-magit-setup-transients)))

(use-package org-sliced-images
  :straight t
  :config
  (org-sliced-images-mode 1))

(use-package beacon
  :straight t
  :config
  (beacon-mode 1))

(defun my-window-resize ()
  "窗口调整模式，连按 h/j/k/l"
  (interactive)
  (message "使用 h/j/k/l 调整窗口大小")
  (set-transient-map
   (let ((map (make-sparse-keymap)))
     (define-key map "h" (lambda () (interactive) (shrink-window-horizontally 3) (my-window-resize)))
     (define-key map "j" (lambda () (interactive) (shrink-window 3) (my-window-resize)))
     (define-key map "k" (lambda () (interactive) (enlarge-window 3) (my-window-resize)))
     (define-key map "l" (lambda () (interactive) (enlarge-window-horizontally 3) (my-window-resize)))
     map)))

(global-set-key (kbd "C-c w") 'my-window-resize)

(use-package gptel
  :straight t
   :config
;; OPTIONAL configuration
(setq gptel-default-mode 'org-mode)
(setq gptel-model 'gpt-4o
      gptel-backend (gptel-make-gh-copilot "Copilot"))

(gptel-make-gh-copilot "Copilot"))

(use-package mcp
  :straight t)

(require 'gptel-integrations)

(setq mcp-hub-servers
      '(("github"
         :command "github-mcp-server"
         :args ("stdio"))))

(use-package gptel-commit
  :straight t
  :after (gptel magit)
  :custom
  (gptel-commit-stream t))

(use-package copilot
  :straight (:host github :repo "copilot-emacs/copilot.el" :files ("*.el"))
  ;; :hook (prog-mode  . copilot-mode)  ; 在编程模式和 org-mode 下自动启用
  :config
  ;; 禁用缩进警告
  (setq copilot-disable-predicates 
        '(copilot-hide-completion-on-escape
          copilot-hide-completion-on-comment
          copilot-hide-completion-on-string))
  (setq copilot-indent-offset-warning-disable t)
  ;; 显示设置
  (setq copilot-enable-predicates '(copilot-hide-completion-on-escape))
  (setq copilot-idle-delay 0.5))

(use-package claude-code-ide
  :straight (:type git :host github :repo "manzaltu/claude-code-ide.el")
  :bind ("C-c C-'" . claude-code-ide-menu)
  :config
  (claude-code-ide-emacs-tools-setup))

(use-package evil-matchit
  :straight t
  :config
  (global-evil-matchit-mode 1)
  )

(use-package evil-anzu
  :straight t
  :after evil
  :diminish
  :demand t
  :init
  (global-anzu-mode t))

(use-package kdl-mode
  :straight t)
